[{"link": "https://www.indeed.co.in/pagead/clk?mo=r&ad=-6NYlbfkN0C4JTuWysBZGWr3ScYyn1q3GP1Wt9Y6KOMkEf9pRAXJOefEmXwTDv0x7eeR7AMe8ZPvwNnyM0UN5ciiiW1OwOg432ptZ886pPcl9956YiQCFJa8OMb1FDqk-_ScW7LvTk2_6s80RONcvdfpaj2K9J_9A6bfMBfQSyz5q1rgFcMcGETFr_aPjc1KL0O7TsUfXcyYK4X4pLNunGkVtkX_u_iJ9DI4dj43VoboOYQB4s-M_aWgKTuK_Wpak5sXqkY45ItMfA_G1AZ1pcRYA4jfN8m_l9KCXlJCcP5EpigwmdkgJ51Tn9rdLR79bXVCZOje-kGISIsevPtA7QO1P5IyB84nCZTBioz-WcBOfKzzGPrf03bsSlHgFMuJ5kLzgwjV5D02KISkvITELFKCRwUgkZIPEJZUWIfCYn6Xs57ilnWw6uDSLE1GE21OVoLPHjg40CA2T0uKOimAj1tDiQ70U5Pkr9BiAul1fWcXv0Tld8uMnVmQdaaRNaJQL1PasGFx9QAD9lbm-RiNGD04vcGiqQeumKHGlEeTRKolOjiwr0tRSp5B0yXSfZTA7pqBADN0-mn-OExrLCImOVYrLpBGskEuSJ0ill0aeYwW-vjYjAOEOfsN31Bf_0mYhZhvBJjIOJ6WmmsTKqQumGHzlIfC_RQisDH-Op6LzzqROZ0IjwKGYYMwd_vequg1YVkLmK4d8PxTOhuRUq0nvtRGR_KDr-_vJHgdrxrTpjht8SnszLLflfSNBRiuORTc0rVrH9kZRbmXFDW3b6Jwz5KlN9Vt9uCjKUFqseXaLt2D9D42HjCtxMQ1dezuHPFIPJ3-dE1YylvsXWyBmrGpSU3dDaJHsgSi_MEw-GyA_Hsms0UuBrrt1Oen2zdaO7XPkW20NjIH8zYFOnNBkxBqNMAGa5fj2elc99YWQw0CJQ7ASWZHBj86F3zZU8876mVF3tpX4IJXxer0Qku7ViMuQ-rFd8LNqVN6k9kQmuDyXKsDI2yTzhearlavBp_yC_-JJFCfhkDUvh4=&p=0&fvj=0&vjs=3", "location": "Bengaluru", "title": "Data Scientist Sales & Channel", "company": "HP", "salary": NaN, "desc": "HP is the world’s leading personal systems and printing company, we create technology that makes life better for everyone, everywhere. Our innovation springs from a team of individuals, each collaborating and contributing their own perspectives, knowledge, and experience to advance the way the world works and lives.\nWe are looking for visionaries, like you, who are ready to make a purposeful impact on the way the world works.\nAt HP, the future is yours to create!\nIf you are our Data Scientist in India, you will get an opportunity to work on below.\n\no Mines data using modern tools and programming languages.\no Defines and implements models to uncover patterns and predictions creating business value and innovation.\no Works with the business to understand the business domain perspective.\no Effectively tells stories with the data using visualization tools/methods to demonstrate insight impact and business value.\no Assures accuracy, integrity, and compliance of cleansed data.\no Maintains proficiency within the data science domain by keeping up with technology and trend shifts.\no Leads a project team of data science professionals\no Collaborates and communicates with project team regarding project progress and issue resolution.\no Represents the data science team for all phases of larger and more-complex development projects.\no Provides guidance, training and mentoring to less experienced staff members.\n\nAre you a high-performer? We are looking for an individual with:\n\no Using statistics, mathematics, algorithms and programming languages.\no Understanding of how to manage disparate unstructured and structured data in a distributed environment.\no Fluent in structured and unstructured data and modern data transformation methodologies.\no Ability to create models to pull valuable insights from data.\no Create stories and visualizations to describe and communicate data insights.\no Ability to use creativity to spot trends and tease out patterns in large datasets.\n\n#LIPOST"}, {"link": "https://www.indeed.co.in/pagead/clk?mo=r&ad=-6NYlbfkN0BKwMOZH4fgpIIWSrlpgS0tSkW3tfilVH9rzQFVfnBGL0LF-9vo0acj_8Lu0aVcpXGVqhthnon5JpH_hR-YI8H4FK6gOsXCwPo0Xi_qlxc0ATL8W06E9xW0DB13UH-Cq1_qomNnagORAc2AHVZiNrCQXtwSX1v9jNf46IJmdaop83myNJDNZX9zKOAjxlYmbl-MllZo2-1RnCmJXh0GRwNV2NeCjR8R1J7Nx4ERa52jH9FQrZYgprqcZr_4zSPP3CTrXcwSIa_iuD-CljZ6dsYrtvm48kd7v4CffPcUCxmx135AsRxwhd3SOGfOP2j83znCERAE3w3ADVXfoRTx9kjFs_o9Z-KD_Bqo6l09RLNWBsib78Srm2S27x5AUCT7wbh6goXyFaRr48AHaO3ey-aJ3x_2vOjr3-kMtMZKzerCz0ZJK-TlUz6-sg50DC577_o_xmAjYHJM1DmETL8mcjGlq1lWxnMYs71ppykFUmebdpdWGlJYmckCK84FNkp1aWMpcfF5Ix_TD8d0kuSANsixeVOzb5UcvTxWKMkFJGwqbyLZSX0Nt2RvlM5mfIP7cLOd9amRNzKRKg==&p=1&fvj=0&vjs=3", "location": "Bengaluru", "title": "Opportunities for Women Talent at Applied Materials", "company": "Applied Materials Inc.", "salary": NaN, "desc": "About Applied Materials:\nApplied Materials is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future.\nWe are exclusively hiring for Women talent across levels and for various positions.\nPlease find below list of job opportunities at Applied Materials India. Once we receive the relevant resume, Staffing team will reach out to you if the profile is shortlisted.\nJava Developer\nC# Developer\nC++ Developer\nData Scientist\nAlgorithm Developer\nMechanical Engineer\nElectrical Engineer\nMechatronics Engineer\nRobotics Engineer\nReliability Engineer\nChemist\nNew Product Manufacturing Engineer\nProcess Engineer\nTechnical Product Support / Global product support\nApplication Engineer\nBusiness Intelligence Analyst\nRF Engineer\nOrder Management\nAnd many more.....\nFunctional Knowledge\nDemonstrates conceptual and practical expertise in own discipline and basic knowledge of related disciplines\nBusiness Expertise\nHas knowledge of best practices and how own area integrates with others; is aware of the competition and the factors that differentiate them in the market\nLeadership\nActs as a resource for colleagues with less experience; may lead small projects with manageable risks and resource requirements\nProblem Solving\nSolves complex problems; takes a new perspective on existing solutions; exercises judgment based on the analysis of multiple sources of information\nImpact\nImpacts a range of customer, operational, project or service activities within own team and other related teams; works within broad guidelines and policies\nInterpersonal Skills\nExplains difficult or sensitive information; works to build consensus\nQualifications\nEducation:\nBachelor's Degree\nSkills\nCertifications:\nLanguages:\nYears of Experience:\n4 - 7 Years\nWork Experience:\nAdditional Information\nTravel:\nNo\nRelocation Eligible:\nNo\nApplied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities."}, {"link": "https://www.indeed.co.in/company/Champions-infometrics/jobs/Data-Scientist-4001ff01c3859b73?fccid=c194d24a5fdce447&vjs=3", "location": "Bengaluru", "title": "Data Scientist", "company": "champions infometrics pvt ltd", "salary": NaN, "desc": "We are hiring Data Engineer / Data Scientist with below criteria.\nKey Responsibilities\n· Coordinate and direct projects through detailed plans and drive integration of business and technical activities\n· Advise Champions’ clients on best practices in software development to maximise return on investment in projects\n· Direct design and development of software platforms/products/product components using Microsoft .NET technologies\n· Provide technical leadership for one or more development teams\n· Work in a cross functional role in collaboration with business analytics teams\n· Consistent focus on delivery quality and quantifiable process improvement\n· Gain strong functional knowledge in the area of business analytics\nDesired Profile\n· Graduate(BE/B.Tech)/Masters(ME/M.Tech/MS) in Computer Science or equivalent from a premier institute (preferably IIT/NIT) with 6+ years’ experience\n· WinForms and web Sourcing (Basic knowledge on data science )\n· Experience in working closely with clients in implementation of business requirements\n· Data oriented mindset with interest in deriving insights though data analysis\n· Excellent knowledge of Microsoft .NET WinForms Applications and ASP MVC 4.0\n· Experience on Object Oriented Design and Analysis, application design patterns\n· Hands on experience in .Net 3.5/4.0, C# ,VB.Net, ADO.Net, web services, Simple Object Access Protocol (SOAP), XML, Json, XSD, SSLWCF, WF , WPF, LINQ, WEB 2.0, ASP.Net with Ajax, Web Services, XML/XSLT, DHTML, JQuery , ASP.Net MVC, Entity Framework\n· Well versed with databases preferably Microsoft SQL server 2012 or higher\n· Knowledge of HTML, CSS, JavaScript is a plus\n· Experience with Agile methodologies like Scrum and Test Driven Development is a plus\n· Strong knowledge of software development best practices\n· Experience of developing web apps for various form factor devices is a plus\n· Good hands-on experience with Code Repository tools (like SVN), Unit Testing Frame works (/JUnit/TestNG) and Java debugging tools\n· Excellent verbal and written communication skills\n· NoSQL Cassandra, MongoDB, DynamoDB is a plus\nThanks ,\nPoojitha\nJob Type: Full-time\nSalary: ₹300,000.00 to ₹1,000,000.00 /year\nExperience:\nwork: 1 year (Preferred)\ntotal work: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nWork Remotely:\nTemporarily due to COVID-19"}, {"link": "https://www.indeed.co.in/rc/clk?jk=f405fff5bfb87ecd&fccid=df6948c9b8da6236&vjs=3", "location": "Bengaluru", "title": "DATA SCIENTIST-(H/F)", "company": "Société Générale", "salary": NaN, "desc": "Vos missions au quotidien\nModel design, feature planning, system infrastructure, production setup and monitoring, and release management.\nExcellent understanding of machine learning techniques and algorithms, such as SVM, Decision Forests, k-NN, Naive Bayes etc.\nExperience in selecting features, building and optimizing classifiers using machine learning techniques.\nPrior experience with data visualization tools, such as D3.js, GGplot, etc..\nGood knowledge on statistics skills, such as distributions, statistical testing, regression, etc..\nAdequate presentation and communication skills to explain results and methodologies to non-technical stakeholders.\nBasic understanding of the banking industry is value add\nEt si c’était vous ?\nDevelop, process, cleanse and enhance data collection procedures from multiple data sources.\nConduct & deliver experiments and proof of concepts to validate business ideas and potential value.\nTest, troubleshoot and enhance the developed models in a distributed environments to improve it's accuracy.\nWork closely with product teams to implement algorithms with Python and/or R.\nDesign and implement scalable predictive models, classifiers leveraging machine learning, data regression.\nFacilitate integration with enterprise applications using APIs to enrich implementations\nMinimum 12+ years of experience in designing/developing industrial IT solutions.\nMinimum 4 years of experience in developing and deploying machine learning, deep learning, NLP solutions.\nExperience with common data science toolkits, such as Scikit, NumPy, R libraries - Excellence in at least one of these is mandatory.\nProficiency with any one NoSQL databases such as MongoDB, Cassandra, HBase.\nShould have prior experience in developing APIs, services using either C# or Java.\nShould have good awareness on entire machine learning/ predictive modeling & implementation\n\nPlus qu’un poste, un tremplin\nWe are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\nPourquoi nous choisir ?\nA 100% owned subsidiary of European banking and financial services major Societe Generale (SG), Societe Generale Global Solution Centre (SG GSC) came into existence in 2000. Established as an offshore development centre in Bangalore, also having a presence in Chennai, SG GSC has 15 years of sustainable delivery expertise to its credit, and develops global best practices to promote the strategic objectives of the Societe Generale Group.\nSG GSC possesses in-depth understanding of the business processes and cutting-edge technologies across domains of Societe Generale’s diverse portfolio. We deliver best-in-class solutions to the Group’s entities in the realm of corporate and investment banking, retail banking, specialized financing and insurance, private banking, and global investment management and services.\nWe place the highest importance on our employees and provide extensive opportunities for career progression and development. SG GSC conforms to the group diversity principles, and has a multi-cultural staff representing seven nationalities, and speaking 20 languages. Women comprise 25% of our workforce.\n\n\nNous sommes un employeur garantissant l'égalité des chances et nous sommes fiers de faire de la diversité une force pour notre entreprise.\nLe groupe s’engage à reconnaître et à promouvoir tous les talents, quels que soient leurs croyances, âge, handicap, parentalité, origine ethnique, nationalité, identité sexuelle ou de genre, orientation sexuelle, appartenance à une organisation politique, religieuse, syndicale ou à une minorité, ou toute autre caractéristique qui pourrait faire l’objet d’une discrimination.\nRéférence: 200008V1\nEntité: SG Global Solution Centre\nDate de début: Immédiat\nDate de publication: 05/07/2020"}, {"link": "https://www.indeed.co.in/company/EVERFORCE-LLC/jobs/Data-Engineer-2fa44993642580a2?fccid=657bc7c51391007d&vjs=3", "location": "Bengaluru", "title": "Data Engineer (Trainee)", "company": "EVERFORCE LLC", "salary": NaN, "desc": "0 to 2 years of experience\nKnowledge in SQL, Python, cloud technologies (AWS, Azure, Google Cloud)\nCourse work/Certification in ML and Python (good to have)\nJob Type: Full-time\nPay: ₹8,000.00 - ₹10,000.00 per month\nExperience:\nKnowledge in SQL, Python, cloud technologies (AWS, Azure, Go: 1 year (Preferred)\nwork: 1 year (Preferred)\nEducation:\nBachelor's (Preferred)\nIndustry:\nIT Operations & Helpdesk\nWork Remotely:\nTemporarily due to COVID-19"}, {"link": "https://www.indeed.co.in/rc/clk?jk=d8299ec4c2fa3718&fccid=1b866506aec22461&vjs=3", "location": "Bengaluru", "title": "Data Scientist Sales & Channel", "company": "HP", "salary": NaN, "desc": "HP is the world’s leading personal systems and printing company, we create technology that makes life better for everyone, everywhere. Our innovation springs from a team of individuals, each collaborating and contributing their own perspectives, knowledge, and experience to advance the way the world works and lives.\nWe are looking for visionaries, like you, who are ready to make a purposeful impact on the way the world works.\nAt HP, the future is yours to create!\nIf you are our Data Scientist in India, you will get an opportunity to work on below.\n\no Mines data using modern tools and programming languages.\no Defines and implements models to uncover patterns and predictions creating business value and innovation.\no Works with the business to understand the business domain perspective.\no Effectively tells stories with the data using visualization tools/methods to demonstrate insight impact and business value.\no Assures accuracy, integrity, and compliance of cleansed data.\no Maintains proficiency within the data science domain by keeping up with technology and trend shifts.\no Leads a project team of data science professionals\no Collaborates and communicates with project team regarding project progress and issue resolution.\no Represents the data science team for all phases of larger and more-complex development projects.\no Provides guidance, training and mentoring to less experienced staff members.\n\nAre you a high-performer? We are looking for an individual with:\n\no Using statistics, mathematics, algorithms and programming languages.\no Understanding of how to manage disparate unstructured and structured data in a distributed environment.\no Fluent in structured and unstructured data and modern data transformation methodologies.\no Ability to create models to pull valuable insights from data.\no Create stories and visualizations to describe and communicate data insights.\no Ability to use creativity to spot trends and tease out patterns in large datasets.\n\n#LIPOST"}, {"link": "https://www.indeed.co.in/rc/clk?jk=d277c99ddc506dc1&fccid=28eefc5b86560831&vjs=3", "location": "Bengaluru", "title": "Financial Data Analyst", "company": "Moody's Corporation", "salary": NaN, "desc": "The Role / Responsibilities:\n\nFinancial Data Analysts have significant input to the ratings and research process by analyzing financial statements and data provided by Issuers.\nThe FDA uses accounting and finance knowledge and judgment to perform financial statement analysis, adjust reported data per relevant methodology requirements and review and analyze ratios\nPerform analysis of various Macroeconomic indicators directly correlated with Sovereign ratings\nResponsible for reviewing and understanding financial statements, official statements and other documents related to issuers’ performance.\nWork directly with ratings and support analysts to explain the data, adjustments and other information needed by the rating team for ratings and research.\nFrequently liaise with analysts and accounting specialists in order to understand the application of accounting concepts on a particular entity.\nCreate documentation and provide guidance to support analysts and outsourcers\nReview, adjust and publish data to external market participants.\n\nIn addition to regular daily responsibilities, FDAs will have the opportunity to work on new projects such as technology projects, accounting changes, analytic reviews, methodology updates and implementation of process improvements.\n\nRegularly interact with Moody's ratings analysts regarding financial and operational data needed for analysis and publications.\n\nThe team is regularly provided with valuable training classes and interaction with Analysts as part of knowledge transfer and career growth.\n\nThe FDA position provides a unique opportunity to foster skills that are valuable to any future career in the financial services industry\n\nQualifications\n\n\nQualifications:\nGraduation or Post-Graduation in Finance / Economics (Eco Hons, MBA, M. Com, etc.) or equivalent qualification; Economics background preferred\n1-3 years of relevant work experience required (can include internship experience).\nStrong knowledge of Microsoft Office products and particularly Excel, such as pivot tables, lookups, etc.\nKnowledge or prior experience in analyzing financial statements is required.\nKnowledge or prior experience in accounting is a plus.\nIndividual must be organized, dependable, able to multi-task and manage priorities, display initiative, and have the ability to work independently in a demanding, fast-paced environment.\nStrong organizational, communication (verbal & written), and interpersonal skills are required.\nLanguage skills may be required for certain positions\nCandidate must have the ability to quickly transition as priorities change to meet demands.\n\nLOB/Department\nADM\nJob Req ID\n18628BR\nEntity\nMoody's Investors Service (MIS)\nLine of Business\nODC (ODC)\nRegular/Temporary\nRegular\nCity\nBangalore\nJob Category\nCredit Analysis & Research\nJob Sub Category\nEconomists\nExperience Level\nExperienced Hire\nWorking at Moody's\nMoody's is an essential component of the global capital markets, providing credit ratings, research, tools and analysis that contribute to transparent and integrated financial markets. Moody's Corporation (NYSE: MCO) is the parent company of Moody's Investors Service, which provides credit ratings and research covering debt instruments and securities, and Moody's Analytics, which offers leading-edge software, advisory services and research for credit and economic analysis and financial risk management. The Corporation, which reported revenue of $4.4 billion in 2018, employs approximately 13,100 people worldwide and maintains a presence in 42 countries. Further information is available at www.moodys.com.\nEntity\nMoody’s Investors Service is among the world’s most respected and widely utilized sources for credit ratings and research. Our opinions and analysis on a broad range of credit obligors and obligations are valued around the world for their insight and rigor.\nMIS Culture of Excellence\nAt MIS, our workplace culture supports our mission to be the Agency of Choice for our customers, employees and future employees. Our Culture focuses on Excellence and embodies behavioral qualities such as Integrity, Responsiveness, Collaboration, Respect and Passion. Our people are our core asset and we look beyond outcomes to ensure that behaviors and interactions matter.\nEEO Policy\nMoody’s is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, sexual orientation, gender expression, gender identity or any other characteristic protected by law.\nSecurities Trading Policy (STP)\nCandidates for Moody's Corporation may be asked to disclose securities holdings pursuant to Moody’s Policy for Securities Trading and the requirements of the position. Employment is contingent upon compliance with the Policy, including remediation of positions in those holdings as necessary."}, {"link": "https://www.indeed.co.in/rc/clk?jk=789d30c36bccb9a3&fccid=de71a49b535e21cb&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "IBM", "salary": NaN, "desc": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems.\n\nYour Role and Responsibilities\nAs a Data Engineer, you play a vital role in building the right infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources.\nExpert in setting up effective pipelines to capture data from multiple sources into the enterprise centric storage.\nComfortable in building effective analytical tools that utilize the data pipeline to provide actionable insights into data synchronization, reporting, operational efficiency and related areas.\nWork with stakeholders including the product owner, data and design teams to assist with data-related technical issues and support their data infrastructure needs.\nCreate and maintain optimal data pipeline architecture.\nIdentify, design, and implement process improvements aimed at automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc.\nAssemble large, complex data sets including legacy structured data warehouse that meet functional / non-functional business requirements.\nCollaborate with DevOps team to develop Continuous Integration/Continuous Delivery pipelines using containerization technologies.\nSolve Big Data and Distributed Data Streaming problems using latest technologies.\nPerform root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.\nManipulate, process and extract value from large disconnected datasets.\nBuild processes supporting data transformation, data structures, metadata, dependency and workload management\nWork on State-of-the-Art cloud technologies provided by IBM Public Cloud, RedHat, AWS & others.\nBe part of open, transparent agile teams who always thrive for continuous learning and contribute towards continuous improvement.\n\n\n\nRequired Technical and Professional Expertise\nPossess strong knowledge in designing database models to store structured & unstructured data efficiently and in creating effective data tools for analytics experts.\nKnowledge in technologies like Hadoop, Spark, Kafka, Scala, Python, etc. Knowledge in relational model databases (like DB2, MySQL, Oracle, ...) and no-SQL databases (MongoDB, Elastic Search, ...)\nKnowledge on enterprise data lakes, data analytics, reporting, in-memory data handling, enterprise integration tools, etc.\nGood understanding of industry best practices for data governance and security.\nGood communication skills and fluent in English.\n\n\n\nPreferred Technical and Professional Expertise\nNone\n\nAbout Business Unit\nWe at IBM Chief Information Office (CIO) are a dynamic group of Business, Strategy and Technology professionals - a specific source of market-leading Industry Consulting, Application and Business process delivery following Agile values and principles. CIO is at the forefront of Digital Reinvention of key applications used within IBM providing value-led and asset-powered end to end solutions.\n\nCIO mission is to create a productive environment for everyone at IBM. We do this by leading with Design to drive simplicity and ease of use, Engineering the systems that run the business, and Innovating to transform the business. Key focus areas are to secure the Enterprise in network security, endpoint security and data security\nTransform IBM and improve collaboration and practice a culture of agile way of working.\n\nWithin the CIO, we represent the Analytic Solutions area of the Sales & Marketing Systems. Our mission is to provide business insights to our partners in sales and marketing to win in the market place through analytics solutions delivered using latest technology and based on real time, consolidated and cloud-based data.\n\nYour Life @ IBM\nWe at IBM Chief Information Office (CIO) are a dynamic group of Business, Strategy and Technology professionals - a specific source of market-leading Industry Consulting, Application and Business process delivery following Agile values and principles. CIO is at the forefront of Digital Reinvention of key applications used within IBM providing value-led and asset-powered end to end solutions.\n\nCIO mission is to create a productive environment for everyone at IBM. We do this by leading with Design to drive simplicity and ease of use, Engineering the systems that run the business, and Innovating to transform the business. Key focus areas are to secure the Enterprise in network security, endpoint security and data security\nTransform IBM and improve collaboration and practice a culture of agile way of working.\n\nWithin the CIO, we do represent the Analytic Solutions area of the Sales & Marketing Systems. Our Mission is to provide business insights to our partners in sales and marketing to win in the market-place through analytics solutions delivered using latest technology and based on real time, consolidated and cloud based data.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}, {"link": "https://www.indeed.co.in/rc/clk?jk=56a135c621c8248c&fccid=df6948c9b8da6236&vjs=3", "location": "Bengaluru", "title": "Senior Data Analyst - Finance Reporting", "company": "Société Générale", "salary": NaN, "desc": "Responsibilities\nCore/Key Responsibilities (include below but not limited to):\n\nAbility to analyze the risk of the process and understand the control built to mitigate/ minimize the risk.\n-Ability to perform in- depth end to end control testing.\nReview of control execution for the Key Controls related to finance to ensure Controls are well followed.\n\n Strong communication skills and knowledge of Second Level Controls\nAssist in implementing the controls framework with Finance team with objective to achieve efficiency and exhaustiveness\n\n Strong interpersonal skills\nProfile Required\nShould have at least 4 to 8 years of experience in IB Operations under Finance function or handling of Second Level Controls for Finance function\nPreferably Exposure to Capital Markets\n\nCore/Key Responsibilities (include below but not limited to):\n\nAbility to analyze the risk of the process and understand the control built to mitigate/ minimize the risk.\n-Ability to perform in- depth end to end control testing.\nReview of control execution for the Key Controls related to finance to ensure Controls are well followed.\n\n Strong communication skills and knowledge of Second Level Controls\nAssist in implementing the controls framework with Finance team with objective to achieve efficiency and exhaustiveness\n\n Strong interpersonal skills\nWhy Join Us\n“We are committed to creating a diverse environment and are proud to be an equal opportunity employer. All qualified applicants receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status”\n\nBusiness Insight\nA 100% owned subsidiary of European banking and financial services major Societe Generale (SG), Societe Generale Global Solution Centre (SG GSC) came into existence in 2000. Established as an offshore development centre in Bangalore, also having a presence in Chennai, SG GSC has 15 years of sustainable delivery expertise to its credit, and develops global best practices to promote the strategic objectives of the Societe Generale Group.\nSG GSC possesses in-depth understanding of the business processes and cutting-edge technologies across domains of Societe Generale’s diverse portfolio. We deliver best-in-class solutions to the Group’s entities in the realm of corporate and investment banking, retail banking, specialized financing and insurance, private banking, and global investment management and services.\nWe place the highest importance on our employees and provide extensive opportunities for career progression and development. SG GSC conforms to the group diversity principles, and has a multi-cultural staff representing seven nationalities, and speaking 20 languages. Women comprise 25% of our workforce.\nWe are an equal opportunities employer and we are proud to make diversity a strength for our company. Societe Generale is committed to recognizing and promoting all talents, regardless of their beliefs, age, disability, parental status, ethnic origin, nationality, sexual or gender identity, sexual orientation, membership of a political, religious, trade union or minority organisation, or any other characteristic that could be subject to discrimination.\nJob code: 20000BTB\nBusiness unit: SG Global Solution Centre\nStarting date: Immediate\nDate of publication: 03/07/2020"}, {"link": "https://www.indeed.co.in/rc/clk?jk=10bf27f41a3def34&fccid=41b40217bbdd7c4a&vjs=3", "location": "Bengaluru", "title": "Clinical Data Analyst", "company": "Navitas Life Sciences", "salary": NaN, "desc": "Category:\nExecutive\n\n\nLocation:\nChennai and Bangalore\n\nJob Type:\nFull Time\n\nEducation:\nAny Degree / Graduate / Post Graduate\n\nJob Description:\n\nUnderstanding of the clinical development process combined with knowledge of real world medicine which allows overcoming the challenges of collecting quality data in a highly stringent regulatory environment. Complete all mandatory training necessary for the job function.\nShould be familiar with CDISC SDTM and ADaM standards.\nProvide primary support for study standardization to the CDISC SDTM by creating the SDTM design specifications, including the Annotated CRF and the specification documents.\nShould be able to create data definition files and Case Report Forms annotated to the CDISC SDTM standard.\nShould be able to train new resources in data standardization processes.\nAbility to work on multiple projects simultaneously and meet last minute and scheduled deadlines.\n\n\nPreferred Skills:\n\nShould be familiar with CDISC SDTM and ADaM standards.\nIf you would like to apply for this position, or would like a discussion about this, or any other role, please send your contact details, together with your curriculum vitae to:\nrecruitment.india@navitaslifesciences.com"}, {"link": "https://www.indeed.co.in/rc/clk?jk=821fda29cf09822c&fccid=38b4474838e7b7a1&vjs=3", "location": "Bengaluru", "title": "Data Scientist", "company": "ABB", "salary": NaN, "desc": "Location\nBangalore, Karnataka, India\nJob type\nFull-Time\nContract\nRegular/Permanent\n\nTake the next step in your career at ABB, working in a team that is dedicated to creating a future where innovative digital technologies allow greater access to cleaner energy.\n\nOne of the reasons for ABB’s success is our rigorous and forward-thinking Finance function. With more than 3,600 people in over 100 countries, the integrated Finance organization delivers the insights we need to make successful, long-term business decisions. You as Data Scientist will be part of Global Advanced Analytics team and will be responsible for\nproviding data insights and analytics to the business.\n\nThis role is based in Bangalore and reporting into Delivery Manager.\n\nYour responsibilities\nWorking with business managers to frame a problem, both mathematically and within the business context.\nUnderstanding business data and how to use it appropriately in data analysis.\nPerforming exploratory data analysis to gain a deeper understanding of the problem.\nConstructing and fitting statistical, machine learning, or optimization models.\nApplying and developing appropriate advanced statistical, machine learning, and/or deep learning models and algorithms to classify structured or unstructured data.\nCollaborating with internal stakeholders to understand business challenges and develop analytical solutions to optimize business processes.\nTesting performance of machine learning and deep learning models.\nPerforming analysis using industry leading text mining, data mining, and analytical tools and open source software.\nPresenting analytical approaches and results to internal audiences by synthesizing complex data and concepts into easy-to comprehend, comprehensive, and cohesive presentations.\nLiving ABB’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues, and the business.\nYour background\nBachelor’s/Master’s degree in Applied Statistics/Mathematics, Engineering, Operations Research.\n3 - 6 years of work experience in advanced analytics.\nHighly proficient with analytical/predictive modeling software (Python/R/SAS or similar).\nStrong understanding and experience with predictive/analytical modeling techniques, theories, principles, and practices.\nAbility to effectively work with a team of data scientists exchanging knowledge.\nAbility to effectively communicate results and methodologies; must be comfortable presenting to executive leadership.\nExperience with data preparation, rationalization, and processing on big data.\nExperience in Natural Language Processing (NLP) and Natural Language Understanding (NLU).\nMore about us\n\nBring your very own sense of pride and purpose as you help us drive forward the Fourth Industrial Revolution – creating a sustainable future for our planet, and your career. Join ABB and harness the power of our diverse global network, as you collaborate with and learn from our world-class teams. Above all, challenge yourself every day. Let’s write the future, together.\n\nImportant, please include in your CV the following passage:\n“I hereby agree for my personal data, included in my job application, to be processed in line with the needs of recruitment, in accordance with the Law on Personal Data Protection of 29th August 1997 (Law Gazette from 2002, No.101, heading 926, as amended).”\n\nReference Number\nIN75029630_E1\nPublication date\n2020-07-02"}, {"link": "https://www.indeed.co.in/rc/clk?jk=59066c2cf30b937c&fccid=fe2d21eef233e94a&vjs=3", "location": "Bengaluru", "title": "Data Engineer I", "company": "ADCI - Karnataka", "salary": NaN, "desc": "Bachelor’s or advanced degree in Math, Finance, Statistics, Engineering, Computer Science or related discipline.\nExperience in data mining (SQL, ETL, data warehouse, etc.) and using databases in a business environment with large-scale, complex datasets\nAdvanced SQL and Excel skills, familiarity with statistics or other analytical techniques\nProven ability to solve complex quantitative business challenges; experience in the development of pricing analysis is a plus\nExcellent written and verbal communication skills\n\nThe Amazon Physical Stores Business Intelligence Team is seeking a highly skilled and motivated Data Engineer to join our team in Bangalore. Our ideal candidate is someone who is always learning and improving as the business grows and the relevant technologies continue to evolve. If you enjoy innovating, thinking big and want to contribute directly to the success of an industry changing business, you may be a prime candidate for this position.\n\nCORE RESPONSIBILITIES:\nDeliver on data architecture projects and implementation of next generation BI solutions.\nManage AWS resources including EC2, RDS, Redshift, Kinesis, EMR, Lambda etc.\nBuild and deliver high quality data architecture and pipelines to support business analyst, data scientists, and customer reporting needs.\nInterface with other technology teams to extract, transform, and load data from a wide variety of data sources.\nContinually improve ongoing reporting and analysis processes, automating or simplifying self-service support for customers.\n\nKnowledge of data visualization and exploration tools (Looker, Tableau, etc.)\nStrong data extraction, analytical and problem solving skills\nThe right candidate thrives in a high energy environment where tactical and strategic activities are expected to be driven in parallel\nHighly innovative, flexible and self-directed\nAdvanced degree in Math, Finance, Statistics, Engineering, Computer Science or related discipline.\n\nAmazon is an Equal Opportunity-Affirmative Action Employer – Minority / Female / Disability /Veteran"}, {"link": "https://www.indeed.co.in/rc/clk?jk=8be2a8130775d7fb&fccid=1658b5f10b7ecad4&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Quaero", "salary": NaN, "desc": "Position Summary:\nQuaero’s Customer Data Platform (CDP) is the leading data management and analytics platform-as-a-service for marketers. This offering originated as an internal capability to drive Quaero’s consulting practice and has evolved into an externally facing product offering. Your role is to continue driving this evolution, and to support further market penetration, through the rapid delivery of new features that delight our end users- data engineers, data scientists and marketing strategists.\nIn this role, you will contribute individually to both design and development. We’ll look to you to employ, instill and enforce best practices in product development and deployment as part of mentoring and further growing a high-performance development team.\nResponsibilities:\nEmploy, instill and enforce best practices in product development and deployment\nProvide leadership, in collaboration with peers, on overall system architecture\nCommit and review code regularly. Demonstrate flexibility to overcome hurdles and drive velocity wherever you are most needed\nParticipate in cross-functional work planning- contributing your particular perspective on all facets of development life-cycle ranging from requirements, design, work planning, testing, delivery and support\nMentor and provide technical leadership to team members\nSkills and Qualifications:\n5-7 years of cumulative experience, in a principal engineer or senior engineer role, dealing with data intensive platforms.\nFluency in Java (Mandatory) and Scala(Preferred)\nAn engineer-at-heart that has demonstrated success at both individual contributor and leadership roles, in early stage and growth environments.\nAbility to reference design patterns that solve a given problem “the right way”, addressing performance, robustness and scalability criteria\nDrive efficient, high quality development operations through automation, systems thinking and unusually strong problem-solving skills.\nHigh proficiency with end to end distributed applications using Spark, apache storm, (or similar technology).\nPrior experience with streaming systems that used RabbitMQ, Kafka, Kinesis, EventHub or DataFlow at the core( preferred)\nExperience utilizing JVM performance measurement tools and tuning approaches.\nUnderstanding of containerization, Kubernetes, Swarms, ECS or similar deployment stack would be a plus\nDelivering enterprise software for B2B customers, with digital and/or direct marketing exposure\nExperience with both traditional(MYSQL/SQL Server) and distributed data base(Hive/ Hbase)\nExperience with Oozie/Airflow(Preferred)\nDemonstrated success as part of team employing agile product development and product management.\n\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=731ceef78d0a4ec5&fccid=1578571ed1bc044d&vjs=3", "location": "Bengaluru", "title": "Data Scientist -1", "company": "Acko General Insurance Limited", "salary": NaN, "desc": "Role and Responsibilities:\nWork closely with Business teams & Product Managers to identify opportunities and serve as an ambassador for data science\nTranslates complex functional and technical requirements into detailed architecture, design, and high performing software and applications.\nWorks with peer developers to make sure that all data solutions are consistent and ensures all automated processes to preserve data by managing the alignment of data availability and integration processes\nEligibility Criteria:\n2 years of experience in the field of statistics, data mining and machine learning\nQualifications:\nBTech/BE Premier institute like IITs/BITS/NITs\nExperience in e-commerce/Online Internet companies\nSkills:\nExpert-level understanding of the underlying theory of Machine Learning.\nYou have superior knowledge of statistical analysis methods, such as input selection, logistic and standard regression, random forests, etc.\nTaking end-to-end ownership of problem domains and continuously improving upon quantitative solutions\nDemonstrated ability to facilitate and work with minimal direction, with the proven ability to coordinate complex activities\nAnalytical thought leadership and stay current on developments in data mining and the application of data science"}, {"link": "https://www.indeed.co.in/rc/clk?jk=ec3099d5072afcb5&fccid=fe2d21eef233e94a&vjs=3", "location": "Bengaluru", "title": "Data Scientist II, Consumer Payments", "company": "ADCI - Karnataka", "salary": NaN, "desc": "Bachelor's degree in a quantitative field (i.e. math, engineering, statistics, finance, or similar)\n4+ years of relevant work experience in data science, business analytics, business intelligence, or comparable experience\nStrong proficiency in MS Excel and relational databases - e.g. Redshift, SQL, ETL, Data Warehouse, etc.\nDeep understanding of common business metrics and the ability to generate new ones as needed\nStrong verbal/written communication & data presentation skills, including an ability to effectively communicate with both business and technical teams\nAn ability to thrive in a highly ambiguous, fast-paced and rapidly-changing environment\nAbility to lead large projects and drive through completion\n\nThe Amazon Payments Team manages all Amazon branded payment offerings, globally. These offerings are growing rapidly and we are continuously adding new market-leading features and launching new products. Our payments products (Amazon Co-Branded Credit Cards, Gift Cards, Points, Shop with Points and Installments ) provide the most innovative payment experience on and off Amazon. We manage a financial services ad serving platform (billions of impressions per year) through Amazon’s purchase path where we offer Amazon branded and non-branded payment products and services. Our team of high caliber software developers, statisticians, analysts and product managers use rigorous quantitative approaches to ensure that we target the right product to the right customer at the right moment, managing tradeoffs between click through rate, approval rates and lifetime value. We leverage the wealth of Amazon’s information to build a wide range of probabilistic models, set up experiments that ensure that we are thriving to reach global optimums and leverage Amazon’s technological infrastructure to display the right offerings in real time. We work closely with product managers to understand their business, collect requirements and deliver high value analytics and insights for the Amazon Payments team that drive acquisition, usage and loyalty. Our petabytes of data has the ability to improve the shopping experience for hundreds of millions of consumers worldwide. Our goal is to delight our customers with their purchasing experience. Those of us who love to work with data see this as the pinnacle of opportunities that you cannot find anywhere else in the world.\n\nWe are looking for an outstanding Data Scientist that is able to comprehend the details behind the Amazon Payments Products business, understand/clarify business requirements, transform volumes of data into actionable insights, serve as the technical/statistics SME, help us improve our targeting methods/models by initiating innovative/creative projects, lead analytical discussions and road map, work across teams and influence the analytical direction of external teams, combine expert statistical/modeling knowledge with programming skills to manage and deliver on complex/critical analysis projects, independently identify and resolve business/technical issues, develop best practices and support our product managers across the world. Amazon.com has a culture of data-driven decision-making, and demands business intelligence that is timely, accurate, innovative and actionable.\n\nMaster’s degree in an analytical field (or equivalent experience)\n2+ years of relevant work experience in data science, business analytics, business intelligence (BI), or comparable experience\nPractical experience in programing or scripting languages like Python, VBA, etc.\nFamiliarity with AWS solutions such as EC2, DynamoDB, and S3\nFinancial service experience is a plus"}, {"link": "https://www.indeed.co.in/rc/clk?jk=96ef064dfd1ad567&fccid=074ddd0d3ab683d0&vjs=3", "location": "Bengaluru", "title": "Data Operations Analyst", "company": "PowerSchool Group LLC", "salary": NaN, "desc": "Overview:\nThe Operation Analyst provides operational support for our award-winning K-12 software systems. This position is responsible for creating, updating and delivering a wide spectrum of data entry, reports and processes relating to the Customer Success organization. The reports and processes managed by the individual in this position will be used for business decision making. The successful candidate will have the ability to create reports in multiple online systems, to follow and update process flows, to analyze and interpret data, and to provide timely delivery of reports to management which will be used for strategic business planning. As an Associate Operations Analyst within PowerSchool, the successful candidate will be a dynamic and organized self-starter who can work independently while also being part of a team.\nResponsibilities:\nEssential duties and responsibilities include the following. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\nUpdate, track, and deliver operational and financial reports on a recurring basis\nRun weekly and monthly recurring reports and provide updates to Execs, Solution Leadership, CS Management and other internal departments as requested\nUtilize Salesforce, Gainsight and DOMO software to build, download, and create reports & dashboards\nCreate and update Executive-level PowerPoints to be used in company-wide presentations\nCreate and maintain a repository of Templates to be standardized across teams\nProvide online systems support to multiple groups within the Customer Success organization\nLiaise with product, finance, accounting, marketing and sales departments to complete projects and gather data as requested\nCompile data sets that will provide analysis of monthly and yearly info/trends on Retention, Renewals, Customer Themes, Net Promoter Score (NPS), and Customer Success business operations\nConduct data analysis; evaluate business processes; determine business needs; identify requirements; develop data system analysis; and provide constructive feedback\nCreate and deliver ad-hoc analysis and all other duties as assigned\nQualifications:\nTo be considered for and to perform this job successfully, an individual must be able to perform each essential duty and responsibility satisfactorily. The requirements listed below are representative of the knowledge, skill and/or ability required.\nQualifications include:\n1-3 years’ prior experience in a data analyst role\nProficient in Microsoft Office suite with an expert knowledge of Excel\nSalesforce or Prior CRM experience required\nUnderstanding of retention practices preferred\nStrong problem solving and reasoning skills\nStrong oral, written, and interpersonal skills\nStrong customer service and conflict resolution skills\nAbility to handle a heavy workload and multiple projects with frequent interruptions and schedule changes\nAssociate degree or equivalent work experience, Bachelor’s degree preferred"}, {"link": "https://www.indeed.co.in/company/Conquest-Technology-Solutions/jobs/Data-Engineer-1afd29590a5279ea?fccid=6377194d55d21983&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Conquest Technology Solutions", "salary": NaN, "desc": "Hi,\nWe are hiring for Data Engineer for the location Banglore with 5 to 10 years of experience candidates, hands on experience on Azure Data Factory,Phyton,Kafka.\nJob Type: Contract\nSalary: ₹471,573.00 to ₹1,795,760.00 /year\nExperience:\nwork: 5 years (Preferred)\ntotal work: 5 years (Preferred)\nEducation:\nBachelor's (Preferred)\nIndustry:\nSoftware Development"}, {"link": "https://www.indeed.co.in/company/Yulu-Bike/jobs/Data-Engineer-df7092a0857336f0?fccid=23640d285e1b24d2&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Yulu Bike", "salary": NaN, "desc": "Working with Big Data tools and frameworks to provide requested capabilities\nIdentify development needs in order to improve and streamline operations\nDevelop and manage BI solutions\nImplementing ETL process and Data Warehousing\nMonitoring performance and managing infrastructure\nSkills and Qualifications:\n4+ years of experience in relevant field\nProficient understanding of distributed computing principles\nProficiency with Hadoop and Spark\nExperience with building stream-processing systems, using solutions such as Kafka and\nSpark-Streaming\nGood knowledge of Data querying tools SQL and Hive\nKnowledge of various ETL techniques and frameworks\nExperience with Python/Java/Scala (at least one)\nExperience with cloud services such as AWS or GCP\nExperience with NoSQL databases, such as DynamoDB,MongoDB will be an advantage\nExcellent written and verbal communication skills\nJob Type: Full-time\nExperience:\nwork: 2 years (Required)\nEducation:\nBachelor's (Required)\nWork Remotely:\nTemporarily due to COVID-19"}, {"link": "https://www.indeed.co.in/rc/clk?jk=29b40dd4bec78def&fccid=1658b5f10b7ecad4&vjs=3", "location": "Bengaluru", "title": "BackEnd/Data Engineer", "company": "Quaero", "salary": NaN, "desc": "Position Summary:\nQuaero’s Customer Data Platform (CDP) is the leading data management and analytics platform-as-a-service for marketers. This offering originated as an internal capability to drive Quaero’s consulting practice and has evolved into an externally facing product offering. Your role is to continue driving this evolution, and to support further market penetration, through the rapid delivery of new features that delight our end users- data engineers, data scientists and marketing strategists.\nIn this role, you will contribute individually to both design and development. We’ll look to you to employ, instill and enforce best practices in product development and deployment as part of mentoring and further growing a high-performance development team.\nResponsibilities:\nIndividual contributor who is involved in design and development of high velocity features, as a part of the product development team\nEmploy, instill and enforce best practices in product development and deployment\nCommit and review code regularly. Demonstrate flexibility to overcome hurdles and drive velocity wherever you are most needed\nParticipate in cross-functional work planning- contributing your particular perspective on all facets of development life-cycle ranging from requirements, design, work planning, testing, delivery and support\nSkills and Qualifications:\n2-4 Years of cumulative experience, in a backend engineer role, dealing with data intensive platforms.\nFluency in Java (Mandatory), Scala(Nice to have),Python(Nice to have)\nExposure to Big Data systems like Hadoop, Map reduce/Spark\nGood understanding of Design Patterns and programming constructs\nGood comfort in working with agile CI/CD (Git) set up\nExperience building Restful API’s\nExperience with springboot, Hibernate, Maven\nExperience utilizing JVM performance measurement tools and tuning approaches.\nUnderstanding of containerization, Swarms, ECS or similar deployment stack would be a plus\nExperience with both traditional(MYSQL/SQL Server) and distributed data base(Hive/ Hbase)\nDemonstrated success as part of team employing agile product development and product management.\nKeywords:\nHadoop, apache spark, EMR, EC2, Java/scala, Python, SQL, hive, Azure/ GCP/AWS.\nEducational Requirements:\nThe candidate must be a B.Tech/M.Tech pass-out from a premier engineering college (IITs, NITs, BITS, IIIT or equivalent) with background in Computer Science or equivalent branch.\n\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=d7a7ef82c84bd85c&fccid=863ad2cc91c92c82&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Groupon, Inc.", "salary": NaN, "desc": "Can data really help local businesses around the world thrive?\n\nAre you ready to test your skills using massive amounts of information to make critical business decisions?\n\nGroupon’s mission is to become the daily habit in local commerce and fulfill our purpose of building strong communities through thriving small businesses by connecting people to a vibrant, global marketplace for local services, experiences and goods. In the process, we’re positively impacting the lives of millions of customers and merchants globally. Even with thousands of employees spread across multiple continents, we still maintain a culture that inspires innovation, rewards risk-taking and celebrates success. If you want to take more ownership of your career, then you're ready to be part of Groupon.\n\nAs a part of our Commercial organization, our Revenue Management Analytics and Platform teams strive to be the voice of the customer in the decisions Groupon makes. We develop and use cutting-edge data technologies to sift through large amounts of data and distill it into information about our customers' wants and needs. We then integrate these insights into our automated decision-making systems to constantly improve our services.\n\nAs a Data Engineer you will be part of our Revenue Management Analytics Data COE, tasked with improving the data and reporting infrastructure that guides decision-making across Marketing, Merchandising, Sales & Ops, Product, and the broader Revenue Management team. You will partner closely with the Analytics team to create data-driven solutions to business problems. The ability to conceptualize and create user-friendly self-service solutions is critical to be successful in this role. Our business is evolving quickly and we need you to think long term, but deliver incrementally.\n\nWe're a \"best of both worlds\" kind of company. We're big enough to have resources and scale, but small enough that a single person has a surprising amount of autonomy and can make a meaningful impact. We're curious, fun, a little intense, and kind of obsessed with helping local businesses thrive. Does that sound like a compelling place to work?\n\nYou’ll spend time on the following:\nDeveloping and maintain new data sources that help drive the business\nArchitecting a new modern event driven architecture to fit AWS processing model (EMR + Spark, S3)\nWorking on Big Data technologies including Hadoop/Hive, PySpark, and Presto\nOther technologies you’ll get to work with include Snowflake for reporting and Airflow for orchestration\nOperating in an agile model leveraging scrum methodologies and Jira tools\nMigrating existing data pipelines from on-prem regional data centers to AWS cloud\nLeading the entire software lifecycle including hands-on development, code reviews, testing, deployment, and documentation for batch ETL's\nWe’re excited about you if you have:\nBachelor’s degree in Computer Science or equivalent with substantial data engineering experience\nAt least 3+ years of recent hands-on SQL programming experience in a Big Data environment is required; Hadoop/Hive experience is preferred\n3+ years of recent hands-on experience with a modern programming language (Scala and/or Python) is required; Spark/Pyspark is preferred\nExperience working in AWS cloud landscape is required\nExperience developing and maintaining ETL applications and data pipelines using big data technologies is required; Airflow experience is a plus!\nAbility to manage multiple stakeholders with excellent communication and interpersonal skills is a must\nUnderstanding of full software development life cycle, agile development and continuous integration\nExcellent understanding of data warehousing and modeling concepts (E.g., Star and snowflake schemas)\nAbility to model data and and develop reporting solution from scratch\nPrior e-commerce experience is a big plus\n\nGroupon's purpose is to build strong communities through thriving small businesses. To learn more about the world's largest local ecommerce marketplace, click here for the latest Groupon news. Plus, be sure to check out the values that shape our culture, guide our strategy and make our company a great place to work. And just don't take our word for it. Hear from real Groupon team members and learn more about our inclusive employee groups. If all of this sounds like something that's a great fit for you, then click apply and let's see where this takes us.\nGroupon is an Equal Opportunity Employer\nQualifications for employment, promotion, and other terms and conditions of employment are based upon the ability to perform the job. Equal-employment opportunities are provided to all applicants and employees without regard to race, creed, religion, color, age, national origin, sex, disability, medical condition, sexual orientation, gender identity or expression, genetic information, ancestry, marital status, military discharge status (excluding dishonorable discharge), veteran status, citizenship status, or other legally protected status. We are all responsible for maintaining this policy. Groupon is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, you may email us at hraccommodations at groupon.com. If you have concerns related to Groupon’s equal employment opportunities, you may contact Groupon's Ethics Reporting Service Ethicspoint."}, {"link": "https://www.indeed.co.in/company/Quaxigma/jobs/Senior-Data-Scientist-fc6fb2727f17073d?fccid=a842adfd131aafdf&vjs=3", "location": "Bengaluru", "title": "Senior Data Scientist - Retail & Insurance", "company": "Quaxigma", "salary": NaN, "desc": "The QuaXigma (U.S. based) was launched with a mission to make A.I accessible and affordable and deliver AI Products/Solutions at scale for the enterprises by bringing the power of Data, AI, and Engineering to drive digital transformation. We believe without insights, businesses will continue to face challenges to better understand their customers and even lose them; Secondly, without insights businesses won't’ be able to deliver differentiated products/services; and Finally, without insights, businesses can’t achieve a new level of “Operational Excellence” is crucial to remain competitive, meeting rising customer expectations, expanding markets, and digitalization.\nThe Senior Data Scientist (Retail & Insurance Analytics) is responsible for applying advanced analytics including both descriptive and predictive analytics to support the business use cases in retail and insurance industry such as to prevent customer churn, identify cross-sell and up-sell opportunities, implement customer personalization, pricing, new customer acquisitions, insurance risk management. This role will need to understand business requirements, conduct quick research, and generate fast prototyping by working closely with business partners. This role will need to communicate findings to ensure models are well understood and incorporated into business processes.\nThis role is required to work flexible hours to work with US team and clients.\nKey Responsibilities\nDesign and build models/algorithms to drive predictive & prescriptive analytics to accelerate business decisions and drive real-time analytical insights\nResearch and brainstorm with internal stakeholders to identify advanced analytics opportunities to advance automation, help with knowledge discovery, support decision-making, gain insights from data, streamline business processes, and enable new capabilities\nLead efforts in advanced analytics solutions to produce value corporate’s unstructured and structured data assets utilizing methodologies from machine learning, deep learning, artificial intelligence, and natural language processing\nDevelop end-to-end efficient model solutions that drive measurable outcomes. Manage the model development lifecycle, including both working with data engineers to identify what data are needed, and training the business end-users on how to leverage the modeling output\nWork with clients in development, assessment, improvement, and transfer of solutions to stakeholder teams as needed\nPrepare documentation, reports, and presentations that explain advanced analytics concepts, technology, and inner workings of solutions to broader teams including non-technical audiences\nJob Qualifications\n5-7 years relevant industrial experience (either retail or insurance industry), in solving complex business problems using data science, statistical techniques & machine learning to build predictive & prescriptive solutions to grow customer base and sales\nMinimum MS degree, but PhD strongly preferred in a quantitative field such as data science, statistics, economics, operations research, computer science, applied mathematics, engineering, etc.\nProven experience in managing and manipulating large, complex datasets\nDemonstrated experience in executing on complex projects, extracting, cleansing, and manipulating large, diverse structured and unstructured data sets on relational – SQL, NOSQL databases\nWorking knowledge of machine learning/artificial intelligence. These technical skills include, but not limited to, regression techniques, neural networks, decision trees, clustering, pattern recognition, probability theory, stochastic systems, Bayesian inference, statistical techniques, deep learning, supervised learning, unsupervised learning\n5+ years of hands-on experience with programming languages such as Python (preferred), R and common machine learning packages such as dplyr, xgboost, glmnet, randomForest, H2o, Numpy, Pandas,scikit-learn, keras, tensorflow, etc.\nExperience in Spark environment is a plus\nHands-on experience in developing and productionizing solutions using tools in Azure and AWS such as Azure ML service, Databricks, Sagemaker\nGood communication and presentation skills, with the ability to tailor the communication style to the right audience\nExperience working in an agile environment with iterative development & business feedback\nExperience providing insights to support strategic decisions, including preparing and delivering insights and recommendations\nJob Type: Full-time\nPay: ₹50.00 - ₹70.00 per hour\nExperience:\nData Science: 5 years (Required)\nRetails or Insurance: 3 years (Required)\nEducation:\nMaster's (Required)\nIndustry:\nInsurance\nWork Remotely:\nTemporarily due to COVID-19"}, {"link": "https://www.indeed.co.in/rc/clk?jk=6a16a431a1ad61cb&fccid=7a0b1c4a661296f7&vjs=3", "location": "Bengaluru", "title": "Data Analyst", "company": "MarketOne International (India)", "salary": NaN, "desc": "MarketOne is looking for a Data Analyst to join our team in our Bangalore office. The Data Analyst is responsible for managing our MS Access DB's and developing new DB’s.\nResponsibilities:\nThis position requires Strong MS Access skills with the proven expertise of building complex MS Access applications using Create DBs, tables, Queries, optimize access queries, forms, reports, modules and visual basic code, Design and build Schema based on business relationships and best practices / Normalization…\nMS SQL server: Ability to write and Query the DB (directly with SSMS, or via MS Access)\nExperience in general database theory and structure like indexes, primary and foreign key relationships.\nMS Access Design, coordinate and implement DB's for staging, processing, and supporting business analyses.\nExperience in migrating MS Access 2010 to Office365\nExtensive experience in Excel (Lookup, Pivot, Fuzzy Lookup)\nAssist with MS Access database development efforts, including planning, database design, coding, tuning and documentation\nStrong verbal and written communication skills and able to communicate with UK, Japan, Australia and US project managers to get requirements.\nAssist with the development of ad-hoc reports using Access, and VBA to address business needs.\nDocumenting and reporting the results and create process documents on working of tools based on necessity.\nResponsible for review of the deliverables of MS Access, QA, maintaining/updating trackers (Quality tracker, Project tracker etc.).\nDemonstrate strong consultative and engaging presentation skills\nSelf-motivated and strong team player.\nHighly developed personal and professional ethics\nRequirements:\nBachelor's degree in Computer Science, Mathematics, Information Management, or a related field\n[4-5] years of experience as a data analyst with MS Access DB’s\nAbility to understand business needs and relay into easy to understand, non-technical language\nGood written and verbal communication skills\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=723a1dfda4ca7600&fccid=fe2d21eef233e94a&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "ADSIPL - Karnataka", "salary": NaN, "desc": "Bachelor or graduate degree in computer science (or related field)\n7+ years experience in a Data Warehouse environment.\n5+ years of hands-on experience in writing complex, highly-optimized SQL queries across large data sets; Expert level skills in Advanced SQL.\nStrong understanding of ETL concepts and experience building them with large-scale, complex datasets.\nDimensional Modeling experience.\nExperience with scripting for automation.\nExcellent verbal & written communication, and documentation skills.\n\nDo you love problem solving? Do you enjoy learning new ideas and apply them to problems? Are you looking for real world engineering challenges? Do you dream about elegant high quality solutions?\nWant to be a part of an amazing team that delivers first class analytical solutions to our business world-wide?\n\nAWS is seeking a highly motivated and passionate Data Engineer who is responsible for developing, maintaining, and supporting the Data Warehouse / Data Mart environment for AWS Procurement and Supply Chain.\n\nThe successful candidate will be passionate about Data Warehousing Architecture, developing reliable, efficient, and maintainable ETL solutions, obsessed with providing our users with robust information solutions, and will possess an excellent understanding of the tools and support needed by the organization in order to develop these solutions productively.\n\nIn this job, you will:\nBuild and improve Data Warehouse / Data Mart solution by translating business requirements into robust, scalable, and supportable solutions that work well within the overall system architecture.\nDesign and Develop Dimensional Data Models to support Data Warehouse Architecture\nExtract and combine data from various heterogeneous data sources; develop new datasets.\nPerform detailed source-system analysis, source-to-target data analysis, and transformation analysis\nDesign and build data mappings from multiple source systems to data warehouse, maintaining source data integrity\nParticipate in the full development cycle for ETL: design, implementation, validation, documentation, and maintenance\nValidate and test ETL build mappings to meet requirements\nEvolve the Data Warehouse environment within the organization, including better information delivery mechanisms and methodologies\nWork to develop the best technical design and approach for new solution development\n\nExperience in cluster based or column based databases\nExperience with AWS Redshift\nExperience with AWS Hammerstone"}, {"link": "https://www.indeed.co.in/rc/clk?jk=302f1bd2315af553&fccid=af103eaff391cdf0&vjs=3", "location": "Bengaluru", "title": "WW Strategic Business Analyst", "company": "Lenovo", "salary": NaN, "desc": "Position Description:\nLenovo is the fastest growing technology company on the planet, with growth outpacing our competition quarter after quarter. Lenovo’s fundamental belief is that life rewards those who Never Stand Still. Every day, every employee at Lenovo is focused on moving forward, rejecting traditional limits, and always seeking a better way. We are looking for the person who challenges the ordinary and seeks to innovate in learning, while also balancing execution.\nWe're looking to add talented individuals who are self-motivated and desire boundless opportunities, to join us. Come share in the discoveries that are forged from our shared achievements at Lenovo as we drive the next generation in technology.\nAre you someone with a passion for data, analytics, insights and technology? Do you want to be part of a team lighting up actionable insights to help the organization make business decisions? Lenovo's Global Business Intelligence team is looking for a passionate, creative, analytical and experienced data scientist who loves big data, curious to explore and unveil insights and create a business story to impact key business decisions. Our team plays a key role in providing data analytics and business insights within the Corporate Analytics group and owns the end to end decision sciences charter that includes:\nbringing the relevant data into a central system to create the single version of truth\ncreating key metrics, reports and dashboards to support business health\nbuilding advanced analytical models (behavior segmentation, churn prediction, purchase propensity, recommendation engine, etc. that spans over sales, marketing, partners, finance and engineering areas.\nResponsibilities:\nProvide internal and external data and perform analytics tasks in support of Lenovo's BU's and regional sales teams.\nParticipate in all activities based on corporate analytics vision and strategy intended to serve both internal business as well as to create value for eCommerce stakeholders\nResponsible for exploring and experimenting with a variety of datasets to draw insights and search for stories within sales funnel as well as recommend changes in tactics to drive business decisions\nModel and build algorithms on top of our vast number of datasets.\nDevelop deeper understanding of internal and external data and systems.\nPosition Requirements:\nBasic Qualifications:\nBachelor's Degree in Computer Science, Data Science, Information Systems or Statistics.\nMinimum three years of experience in data analytics.\nHands on experience of 2+ years in Adobe Analytics, Tableau / Power BI, R and/or Python.\nPreferred Qualifications:\nMaster's Degree in Computer Science, Data Science, Information Systems or Statistics.\nAbility to manage multiple active projects proceeding in parallel.\nDriven by the desire to seek answer to \"so what?\" business question than being enamored by \"what’s new?\"\nExcellent listening, verbal, written, and presentation skills.\nAbility to quickly assimilate relevant information in unfamiliar situations.\nAbility to develop creative approaches and solutions necessary to resolve complex problems.\nAbility to use a vast array of analytical tools.\nDemonstrated ability to source data across a variety of structured and unstructured data sources.\nDemonstrated ability to work under time constraints while delivering incremental value.\nProducing high quality work for business presentations and reports.\nDemonstrated ability to work in a team environment with minimal supervision.\nExcellent business acumen and sound judgment.\nWe are an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, religion, sexual orientation, gender identity, status as a veteran, and basis of disability or any federal, state, or local protected class."}, {"link": "https://www.indeed.co.in/rc/clk?jk=3f604e91f6358889&fccid=e223a70f4b467dcd&vjs=3", "location": "Bengaluru", "title": "Zensar is hiring for Data Engineer Professionals", "company": "Zensar Technologies Limited", "salary": NaN, "desc": "1.Document DB (Preferably Couchbase/cosmos) (Good to have)\n2.ADF (Should have)\n3.Python (Must have)\n4.Kafka (Must have)\n5.Azure Synapsis (DW) (Good to have)\n6.Azure HD Insight (Should have)\n7.Working experience with campaigns and mobile apps data (Structured/Semi structured data) (Must have)\n8.Knowledge on Data Governance Tools (Should have)\n\n5.00-10.00 Years"}, {"link": "https://www.indeed.co.in/rc/clk?jk=0493dccc52540f4b&fccid=462555dec0279094&vjs=3", "location": "Bengaluru", "title": "Senior Data Analyst", "company": "Unisys", "salary": NaN, "desc": "We Believe in Better!\nWe are a global information technology company that builds high-performance, security-centric solutions that can help change the world. Enhancing people’s lives through secure, reliable advanced technology is our vision.\nAt Unisys, we believe in better! Here, you have the opportunity to learn new skills, apply your expertise, and solve complex problems with cutting edge technologies and solutions. You are part of a global diverse team that supports you, drives change, and delivers successful results consistently.\nOur associates are at the forefront of everything we do, driving our clients’ successes while giving back to communities and making a positive impact on enhancing the quality of life to help make this world a safer and more secure place to live and work. Our success is a direct result of the work of our people who live and breathe our Core Beliefs. Simply put, we believe in better lives. Join us!\nLearn more about Unisys and our key solution offerings: Unisys, Stealth , CloudForte , Intelliserve\nWhat success looks like in this role:\nKey Responsibilities/Outcomes\nIntermediate Understanding on all Areas we deliver Reporting Services\nCreate/Update complex reports\nConduct calls with Account Teams for requirements\nConduct calls with External Clients\nSchedule existing reports\nCross-Training/Coaching for Team Members\nOperational Analytics Knowledge\nSupport on managing escalations to closure\nDevelops solutions to complex problems.\nContribute to and/or guide the completion of specific programs and projects.\nTechnical lead within the team, supervising and guiding skilled and/or lower skilled/routine team workers.\nSupport leads on managing escalations and critical activities.\nInterfaces with all customer services management to provide historical account information to enable business decisions on selected critical accounts.\nFacilitates profit reviews on targeted accounts, provides profitability and service delivery analyses, and contributes to Operation goals for account profitability.\nContributes to division margin improvement goals and provides data to Operation to prepare valuable account analysis.\nDevelops and submits Program financials to the Unisys Finance Organization.\nSupports the refinement of EVM Certification Documents.\nProvides recommendations on internal project set-up.\nGenerates Timecard, Other Direct Cost and Labor reports on a regular basis to ensure all costs are accurately recorded.\nPrepares back-up reports for customer invoicing, including, but not limited to:\nLabor Detail\nNon-Labor Detail, including ODC and travel\nExplanations for all of the travel and Other Direct Costs\nCosts by Contract Work Breakdown Structure (CWBS)\nCumulative costs for the entire Program by CWBS\nPrepares the actual hours and dollars reports charged to the Program for the monthly Cost Performance Review 6 (CPR6) that is submitted to the customer\nParticipates in the preliminary Cost Performance Review and Program Management Review meetings with the customer.\nAssists Program Management with finance inquiries.\nSupports the Project Controller with any corrections to the invoice and opening new project numbers as well as map employees to projects.\n• • Updates the forecasting spreadsheets for a Program, as needed to maintain accurate financial data.\nYou will be successful in this role if you have:\nKey Qualifications\nBS degree in IT or related field and a minimum of 4 years’ of experience in related project accounting and/or earned value management experience\nApplies extensive expertise and has knowledge of other related disciplines.\nTechnical expertise on tools used by Global Reporting Team\nAbility to work without appreciable direction.\nExperience with and knowledge of:\nSQL\nEnterprise Reporting Suite (Business Objects / MSBI)\nMicrosoft Office, including Word, Excel, PowerPoint, Access and Outlook\nPower BI Expert\nITIL required\nExperienced in delivering high caliber soft skills including time management, interpersonal skills (e.g. courtesy, patience, and professionalism), work flow management and customer ser"}, {"link": "https://www.indeed.co.in/rc/clk?jk=b808828930d9e3ab&fccid=b11b139fe72c1f23&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Cervello Inc", "salary": NaN, "desc": "Summary:\n\nYou have experience with client projects and in handling vast amounts of data – working on database design and development, data integration and ingestion, designing ETL architectures using a variety of ETL tools and techniques. You are someone with a drive to implement the best possible solutions for clients and work closely with a highly skilled Analytics team. Play a key role on projects from a data engineering perspective, working with our Architects and clients to model the data landscape, obtain data extracts and define secure data exchange approaches.\nPlan and execute secure, good practice data integration strategies and approaches\nAcquire, ingest, and process data from multiple sources and systems into Big Data platforms\nCreate and manage data environments in the Cloud\nCollaborate with our business analysts and data scientists to map data fields to hypotheses and curate, wrangle, and prepare data for use in their advanced analytical models\nHave a strong understanding of Information Security principles to ensure compliant handling and management of client data\nThis is a fantastic opportunity to be involved in end-to-end data management for cutting edge Advanced Analytics and Data Science\nQualifications:\nExperience on client-facing projects, including working in close-knit teams\nExperience and interest in Big Data technologies (Hadoop / Spark / NoSQL DBs)\nExperience or familiarity with real-time ingestion and streaming frameworks is a plus\nExperience and desire to work with open source and branded open source frameworks\nExperience working on projects within the cloud ideally AWS or Azure\nExperience with NLP, Machine Learning, etc. is a plus\nExperience working on lively projects and a consulting setting, often working on different and multiple projects at the same time\nStrong development background with experience in at least two scripting, object oriented or functional programming language, etc. SQL, Python, Java, Scala, C#, R\nData Warehousing experience, building operational ETL data pipelines across a number of sources, and constructing relational and dimensional data models\nExcellent interpersonal skills when interacting with clients in a clear, timely, and professional manner.\nA deep personal motivation to always produce outstanding work for your clients and colleagues\nExcel in team collaboration and working with others from diverse skill-sets and backgrounds\nCervello is a dynamic technology company that is focused on business analytics and planning. We take an innovative approach to making complex solutions simple so our clients can focus on running their businesses. Our services and applications enable our clients to gain the benefits of a world-class analytics and planning capability without the headaches.\n\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=d49843dc1bcc9062&fccid=1658b5f10b7ecad4&vjs=3", "location": "Bengaluru", "title": "Lead BackEnd/Data Engineer", "company": "Quaero", "salary": NaN, "desc": "Position Summary:\nQuaero’s Customer Data Platform (CDP) is the leading data management and analytics platform-as-a-service for marketers. This offering originated as an internal capability to drive Quaero’s consulting practice and has evolved into an externally facing product offering. Your role is to continue driving this evolution, and to support further market penetration, through the rapid delivery of new features that delight our end users- data engineers, data scientists and marketing strategists.\nIn this role, you will contribute individually to both design and development. We’ll look to you to employ, instill and enforce best practices in product development and deployment as part of mentoring and further growing a high-performance development team.\nResponsibilities:\nEmploy, instill and enforce best practices in product development and deployment\nLead technical design and delivery of individual features\nProvide leadership, in collaboration with peers, on overall system architecture\nCommit and review code regularly. Demonstrate flexibility to overcome hurdles and drive velocity wherever you are most needed\nParticipate in cross-functional work planning- contributing your particular perspective on all facets of development life-cycle ranging from requirements, design, work planning, testing, delivery and support\nMentor and provide technical leadership to team members\nSkills and Qualifications:\n7+ years of cumulative experience, in a lead/principal engineer or architect position, dealing with data intensive platforms.\nAn engineer-at-heart that has demonstrated success at both individual contributor and leadership roles, in early stage and growth environments.\nAbility to reference design patterns that solve a given problem “the right way”, addressing performance, robustness and scalability criteria\nDrive efficient, high quality development operations through automation, systems thinking and unusually strong problem-solving skills.\nFluency in Java (Mandatory) and Scala(Preferred)\nHigh proficiency with end to end distributed applications using Spark, apache storm, (or similar technology).\nPrior experience with streaming systems that used RabbitMQ, Kafka, Kinesis, EventHub or DataFlow at the core( preferred)\nExperience utilizing JVM performance measurement tools and tuning approaches.\nUnderstanding of containerization, Kubernetes, Swarms, ECS or similar deployment stack would be a plus\nDelivering enterprise software for B2B customers, with digital and/or direct marketing exposure\nExperience with both traditional(MYSQL/SQL Server) and distributed data base(Hive/ Hbase)\nExperience with Oozie/Airflow(Preferred)\nDemonstrated success as part of team employing agile product development and product management.\nKeywords:\nHadoop, apache spark EMR, EC2, Java/scala, Docker, SQL, hive, Azure/ GCP/AWS.\nEducational Requirements:\nThe candidate must be a B.Tech/M.Tech pass-out from a premier engineering college (IITs, NITs, BITS, IIIT or equivalent) with background in Computer Science or equivalent branch.\n\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=77e462d84320e344&fccid=41b40217bbdd7c4a&vjs=3", "location": "Bengaluru", "title": "Senior Clinical Data Analyst", "company": "Navitas Life Sciences", "salary": NaN, "desc": "Category:\nExperienced (non-manager)\n\n\nLocation:\nChennai and Bangalore\n\nJob Type:\nFull Time\n\nEducation:\nAny Degree / Graduate / Post Graduate\n\nJob Description:\n\nProvide primary support for study standardization to the CDISC SDTM by creating the SDTM design specifications, including the Annotated CRF and the specification documents.\nWill oversee execution of the specification by the implementation team, as well as manage the SDTM design specification lifecycle.\nWork closely with the project managers as the primary interface with clients during the standardization projects.\nPerform as a team leader for the CDISC team including planning and executing meetings. Mentor and guide the junior analysts.\nCreation of data definition files and Case Report Forms annotated to the CDISC SDTM.\nCommunicate with clients on all project-related issues or queries.\nAbility to work on multiple projects simultaneously and meet last minute and scheduled deadlines\n\n\nPreferred Skills:\n\nProvide primary support for study standardization to the CDISC SDTM by creating the SDTM design specifications, including the Annotated CRF and the specification documents.\nIf you would like to apply for this position, or would like a discussion about this, or any other role, please send your contact details, together with your curriculum vitae to:\nrecruitment.india@navitaslifesciences.com"}, {"link": "https://www.indeed.co.in/rc/clk?jk=9e3c720621615266&fccid=0c39fb2c91742dcf&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "Morgan Stanley", "salary": NaN, "desc": "Data Engineer\nJob Number:\n3153655\nPOSTING DATE: Jun 30, 2020\nPRIMARY LOCATION: Non-Japan Asia-India-Karnataka-Bengaluru\nEDUCATION LEVEL: Bachelor's Degree\nJOB: Engineering\nEMPLOYMENT TYPE: Full Time\nJOB LEVEL: Associate\nDESCRIPTION\nAbout Us :\n\nMorgan Stanley is a leading global financial services firm providing a wide range of investment banking, securities, investment management and wealth management services. The Firm's employees serve clients worldwide including corporations, governments and individuals from more than 1,200 offices in 43 countries. As a market leader, the talent and passion of our people is critical to our success. Together, we share a common set of values rooted in integrity, excellence and strong team ethic. We provide you a superior foundation for building a professional career where you can learn, achieve and grow. A philosophy that balances personal lifestyles, perspectives and needs is an important part of our culture.\nTechnology/Role/Department at Morgan Stanley:\n\nTechnology is the key differentiator that ensures that we manage our global businesses and serve clients on a market-leading platform that is resilient, safe, efficient, smart, fast and flexible. Technology redefines how we do business in global, complex and dynamic financial markets. We have a large number of award-winning technology platforms that help to propel our Firm’s businesses to be the top in the market. Our India technology teams are based in Mumbai and Bengaluru. We have built strong techno-functional teams which partner with our offices globally taking global ownership of systems and products. We have a vibrant and diverse mix of technologists working on different technologies and functional domains. There is a large focus on innovation, inclusion, giving back to the community and sharing knowledge.\nMorgan Stanley is seeking an experienced and ambitious candidate to join their Enterprise Computing (EC) Site Reliability Engineering group as an automation development lead. The group is responsible for managing all the Linux-based infrastructure and middleware for the firm. This includes the virtualisation, OS, storage and web platforms, plus databases, messaging buses and other foundational services upon which developers build their applications. The group aims to provide fully automated management solutions to maximise the availability and stability of the infrastructure it manages.\nJob Responsibilities\n\nThe primary focus of this role is to lead a team of developers in building automation tools in python which control and manage the Morgan Stanley private cloud infrastructure platform.\no Oversee the quality of the technical deliveries, and the day-to-day supervision of the developers in his or her team or squad.\no Liaise with the infrastructure SMEs to agree on quantitative quality and delivery goals, and be accountable for those metrics.\no Act as scrum master for the squad when there is no dedicated scrum master available.\nThe successful candidate will be responsible for mentoring and developing junior team members.\nThe candidates should be comfortable reviewing code written by others and giving constructive feedback.\nThey must demonstrate initiative, good judgement, be confident working independently and be comfortable handling sensitive, confidential information.\n\nQUALIFICATIONS\n\nPrimary Skills:\n\n7+ years of overall IT experience\n3+ years of experience of developing in Python, including the use of RESTful APIs, and how to write comprehensive unit tests;.\nKnowledge of software engineering concepts such as common data structures, object-oriented programming, and regular expressions.\nComfortable working in a Linux CLI environment, using modern development and troubleshooting tools such as git, CI/CD pipelines, and tcpdump.\nExperience with Agile methodologies, GIT and CICD.\n\nDesired Skills:\n\nExperience with using Ansible for large scale infrastructure automation.\n\nMorgan Stanley is an equal opportunities employer. We work to provide a supportive and inclusive environment where all individuals can maximize their full potential."}, {"link": "https://www.indeed.co.in/rc/clk?jk=8d2eae5953bc2ea9&fccid=f80139d7eb255fbe&vjs=3", "location": "Bengaluru", "title": "Structured Data Analyst", "company": "Tech Wynk It Solutions LLP", "salary": NaN, "desc": "Requirements:\nâ—Advanced understanding of SQL / Presto other similar language\nâ—Experience working with and consolidating multiple data sources (direct from engines, google sheets, FTP, HTTP etc.)\nâ—Strong analytical individual who enjoys lateral thinking and problem solving\nâ—Attention to detail and able to effectively troubleshoot issues across various data sources and platforms\nâ—Proactive individual who is confident taking the initiative and working with colleagues across teams and departments\n\nDesired Skills:\nâ—Understanding of Google shopping mechanics and product feed structure\nâ—Any additional coding or data management experience\n\nResponsibilities:\nâ—Liaising with internal teams, addressing their feed challenges or opportunities, creating bespoke solutions using technology\nâ—End to end management of feeds for various channels and platforms, including (but not limited to) Google and Bing shopping, social, affiliates and display activity.\nâ—‹This includes identifying and sourcing available raw data, managing the content, and combining data from any additional sources (currently available or new)\nâ—Working with the Structured Data and Development teams to identify and implement changes to the available systems\nâ—Stay abreast of developments in the industry, changes to formats, performance factors, and other industry services\n\n4.00-8.00 Years"}, {"link": "https://www.indeed.co.in/rc/clk?jk=b406642c49aba667&fccid=8451da735479b1a2&vjs=3", "location": "Bengaluru", "title": "Data Analyst", "company": "Cadmaxx Solutions Private Limited", "salary": NaN, "desc": "Experience : 3-8 years\nJob Type : Permanent\nWork Location : Whitefield,Bangalore.\n\nNotice Period : IMMEDIATE ONLY\n.\nSkills : Big Data,Python development,REST API,Data Visualisation.\n\nMail ID : hr10@cadmaxx.com\nContact Number : 9739866653\n\n3.00-8.00 Years"}, {"link": "https://www.indeed.co.in/rc/clk?jk=6b1595728d173f39&fccid=a7d4f8a12bc3bdcc&vjs=3", "location": "Bengaluru", "title": "SENIOR DATA ENGINEER", "company": "Happiest Minds Technologies", "salary": NaN, "desc": "DATA ENGINEER\n\n\nAbout Happiest MindsTechnologies\nHappiest Minds, the Mindful IT Company, applies agile methodologies to enable digital transformation for enterprises and technology providers by delivering seamless customer experience, business efficiency and actionable insights. We leverage a spectrum of disruptive technologies such as: Big Data Analytics, AI & Cognitive Computing, Internet of Things, Cloud, Security, SDN-NFV, RPA, Blockchain, etc. Positioned as “Born Digital . Born Agile”, our capabilities spans across product engineering, digital business solutions, infrastructure management and security services. We deliver these services across industry sectors such as retail, consumer packaged goods, edutech, e-commerce, banking, insurance, hi-tech, engineering R&D, manufacturing, automotive and travel/transportation/hospitality.\nHeadquartered in Bangalore, India; Happiest Minds has operations in USA, UK, The Netherlands, Australia and Middle East.\nSkills\nRequired Skills:\nPython, Spark Streaming, Snowflake/Redshift,\nRoles and responsibilities\nBuild and review data pipelines for data ingestion, data cleansing, aggregation, and readying data for consumption\nBuild the infrastructure, data pipelines required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL, Data bricks and AWS big data technologies\nCreate data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader\nWork on integration and deployment tools, methods to manage dev life cycle until production\nCollaborate with engineers, leads to deliver solutions\nParticipate in conversations and provide technical solutions on escalated production, performance and availability issues\nWork with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.\nWhat We’re Looking For\nAdvance working on SQL.\nStrong hands-on with Big data – Hadoop, Spark, Kinesis. Stream processing systems – Spark and Kafka\nExperience working with relational databases – Snowflake and Postgres\nProficient in at least one of the general-purpose programming languages like Python, Scala.\nDatabases – Oracle/SQL server/Oracle o Data pipeline and workflow management tool – Airflow\nAWS – EC2, RDS, S3\nBuilding and optimizing big data pipelines, architectures and data sets.\n\nStaffing Type: Permanent"}, {"link": "https://www.indeed.co.in/rc/clk?jk=7b88899bc57e701d&fccid=077a68fba2681475&vjs=3", "location": "Bengaluru", "title": "Data Engineer", "company": "TalentFirst HR Consulting Private Limited", "salary": NaN, "desc": "Job Title: Data Engineer (Talend/Bigdata)\n\nPrimary Responsibilities:\nâ€¢Lead and deliver complete application lifecycle design, development, deployment, and support for actionable BI and Advanced Analytics solutions\nâ€¢Design and develop data models and ETL process for structured and unstructured data that is distributed across the globe between Cloud and On-Premises\nâ€¢Develop and deliver solutions with data streaming capabilities for large volume of factory data\nâ€¢Demonstrate and document the development methodology, results and insights to the business partners and senior leadership.\nâ€¢Work directly with management and Business units to design, configure, support cloud deployment, and performance tuning/optimization.\nâ€¢Develop design documents and translates into component-level designs to accelerate development.\n\nCompetencies & Experience Required/Desired\n\nYou Must Have:\nâ€¢8+ years of experience in data modeling and ETL using industrial leading tools to process the data using RDBMS, In-Memory and Bigdata data stores\nâ€¢5+ years of experience in deploying custom data solution using Talend\nâ€¢4+ years of experience in Big Data development using Cloudera Hadoop (Hive, Impala & Talend)\nâ€¢3+ years of experience in developing flows using data streaming, batch processing, and Microservices\nâ€¢2+ years of experience with AWS tools such as S3, EC2, ECS, EKS, SageMaker, Aurora, Redshift, RDS, Lambda Functions AMI, ELB, ALB, NLB, VPC, Auto Scaling configurations, DMS, Amazon FW, API Gateway, IAM, CloudTrail, and CloudFront.\nâ€¢Multiple experiences in implementing solutions involving unstructured data using Talend\nâ€¢Strong problem-solving capabilities. Results oriented. Relies on fact-based logic for decision-making.\nâ€¢Ability to work with multiple projects and work streams at one time. Must be able to deliver results based upon project deadlines.\nâ€¢Willing to flex daily work schedule to allow for time-zone differences for global team communications\nâ€¢Strong interpersonal and communication skills\nâ€¢Degree in Management Information Systems, Computer Science OR equivalent work experience in an IT organization\n\nWe Value:\nâ€¢Having subject matter expertise in one or more of the functional areas such as Sales, Finance, Manufacturing, production planning, purchasing, marketing, engineering\nâ€¢Experience in demonstrating the challenges and recommendation to leadership team in a precise manner\nâ€¢Prior working experience with SAP HANA, SAP ERP, SAP BW environments\nâ€¢Experience in visualization tools\nâ€¢Experience in developing basic data science models using Python or a similar language\nâ€¢Java development and API management experience is a great plus\n\n6.00-10.00 Years"}, {"link": "https://www.indeed.co.in/company/Bluesky-Inventions/jobs/Azure-Data-Engineer-20453904f8a7d8cc?fccid=6444cdc2e047e64b&vjs=3", "location": "Bengaluru", "title": "Azure Data Engineer", "company": "Bluesky Inventions", "salary": NaN, "desc": "ABOUT US\nWe are the change agents for Next-Gen Digital Products\nThe company is founded by Ex Qualcomm and Samsung professionals with cumulative experience of 100+ yrs in Mobile Industry. Based out of Bangalore & New Delhi, we strive to create a smart Mobile world with all our clients and partners. We directly work with our parters like OEMs, Telecom Operators & Enterprises to develop custom solutions for engaging users with intuitive user experience and there by creating revenue opportunities.\nIn current scenario, mobile experiences have become integral part of all Brands, Enterprises or Mobile OEMs. It can be either custom enterprise chat application or digital mobile store , the mobility strategy improves the user engagement and the brand to a greater extent. Defining the right mobile strategy, transforming that into an intuitive user experience and developing it through robust cutting-edge technologies needs a most experienced and specialised Mobility partner. That’s where we as Bluesky team comes into deliver all the customer needs.\nUrgent Requirement - Azure Data Engineer\nExperience: 2-6 years\nEducation: BE, BTech, MTech, MCA and any equivalent degrees\nLocation: Whitefield,Bengaluru\nNotice Period: Immediate Joinee\nIdeal Candidate Requirement:\n- A minimum of 2 years experience as a Data Engineer/Azure Technologies.\n- Must be proficient in Python, ADF, Kafka.\n- Well versed with Azure Technologies.\n- Knowledge on Data Governance tool.\n- Capability to work with deadline.\n- Good knowledge of identifying and solving problems and enjoy working in teams.\n- Strong organizational skills to manage multiple tasks within the constraints of the timeline, with minimum supervision & full ownership.\n- Ability to work and succeed in a fast-paced development environment and learn rapidly.\nJob Type: Full-time\nExperience:\nData Engineer/Azure: 2 years (Required)"}, {"link": "https://www.indeed.co.in/rc/clk?jk=1d2f6197e14cc8c1&fccid=a3f737e511d9fc8c&vjs=3", "location": "Bengaluru", "title": "Staff Data Engineer – Payments Systems Risk", "company": "Visa", "salary": NaN, "desc": "Company Description\nAs the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce.\nAt Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers.\nYou're an Individual. We're the team for you. Together, let's transform the way the world pays.\n\nJob Description\nTo ensure that Visa’s payment technology is truly available to everyone, everywhere requires the success of our key bank or merchant partners and internal business units. The Global Data Science group supports these partners by using our extraordinarily rich data set that spans more than 3 billion cards globally and captures more than 100 billion transactions in a single year.\nThe Payment Systems Risk team within Visa Data Product is responsible for building critical risk and fraud prevention applications and services at VISA. This includes idea generation, architecture, design, development, and testing of products, applications, and services that provide Visa clients with solutions to detect, prevent, and mitigate risk for Visa and Visa client payment systems.\nAre you skilled at turning hard numbers into compelling stories and useful strategic insights? Do you solve complex data challenges with creative flair? Put those skills to work answering strategic questions for one of the world's most respected and innovative payments companies.\nAs a Staff Data Engineer, you will be responsible to establish processes, automations, structures and big data systems based on business and technical requirements to channel multiple requirements, route appropriately and plan proper big data technology using combination of open source and vendor supported big data technologies, databases, and other applicable big data technologies as required.\nEssential Functions\nWork with manager and clients to fully understand business requirements and desired business outcomes\nAssist in scoping and designing analytic data assets, implementing modelled attributes and contributing to brainstorming sessions\nBuild and maintain a robust data engineering process to develop and implement self-serve data and tools for Visa’s data scientists\nPerform other tasks on R&D, data governance, system infrastructure, analytics tool evaluation, and other cross team functions, on an as-needed basis\nFind opportunities to create, automate and scale repeatable analyses or build self-service tools for business users\nExecute data engineering projects ranging from small to large either individually or as part of a project team\nEnsure project delivery within timelines and budget requirements\nProvide coaching and mentoring to junior team members\n\nQualifications\nBachelor degree in a technical field such as computer science, computer engineering or related field required. Advanced degree preferred\nMinimum of 8 years of software development experience (with a concentration in data centric initiatives), with demonstrated expertise in leveraging standard development best practice methodologies\nMinimum of 3 to 4 years of experience in building large-scale applications using open source technologies. Design and coding skills with Big Data technologies like Hadoop, Spark, Hive, and Map Reduce\nMinimum of 4 years of hands-on expertise with Java or Scala\nExperience with highly distributed, scalable, concurrent and low latency systems working with one or more of the following database technologies: DB2, MySQL and NoSQL data warehouses such as HBase\nExperience working in an Agile and Test Driven Development environment.\nExperience with Continuous Integration and Automated Test tools such as Jenkins, Artifactory, Git, Selenium, Chef desirable\nExperience with data visualization and business intelligence tools like Tableau, Microstrategy, or other programs highly desired\nExperience with SAS as a statistical package is preferred\nFamiliarity or experience with data mining and statistical modeling (e.g., regression modeling, clustering techniques, decision trees, etc.) is preferred\n\nAdditional Information\nVisa will consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law.\nREF27155D"}, {"link": "https://www.indeed.co.in/rc/clk?jk=d082d88d02fb0cb4&fccid=cd22d01053af7669&vjs=3", "location": "Bengaluru", "title": "Senior Data Engineer", "company": "Oracle", "salary": NaN, "desc": "Senior Data Engineer-20000IDH\n\nApplicants are required to read, write, and speak the following languages: English\nPreferred Qualifications\nSenior Data Engineer Posting (Oracle-CrowdTwist)\nAbout CrowdTwist/Oracle Marketing Cloud:\nCrowdTwist provides the most comprehensive omni-channel loyalty & analytics SaaS platform for industry leading brands. We have grown from being a small startup to a respected platform with hundreds of millions of users and billions of interactions. After our recent acquisition by Oracle, we are looking to write the next chapter in user growth and scale. We're relaxed, experienced, hard driving and are experiencing explosive growth. We power the loyalty offerings for many of the world’s top brands such as Lego, Disney, Weight Watchers, Marvel Comics, AMC’s The Walking Dead, Foot Locker and Zumiez. We're relaxed, experienced, hard driving, changing our industry and looking for smart people to help tackle tough technical challenges.\nAbout the Opportunity\nWe are seeking a talented and experienced Data Engineer for our growing team based in Bangalore. Our cloud-first SaaS platform is built using Distributed Microservices Architecture, on Linux, Java, PHP, Oracle & MySQL; we use RabbitMQ as our messaging backbone and NoSQL databases like Redis, DynamoDB, Neo4j, etc. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward. At over one million lines of code, you’ll be working with large, highly trafficked, scalable applications. Quality and high availability is of extreme importance to us, so we're looking for a professional engineer that takes a pragmatic and passionate approach to technology to solve problems and keeps the application uptime high.\nResponsibilities:\nDesign and develop high-performing, scalable, and fault tolerant data pipelines\nOwn the data model for our analytics needs, ensuring that data is standardized and accessible\nWork with Product and Engineering to ensure upstream product model changes integrate well with our data model; and when it doesn’t build the necessary capabilities to adjust\nManage individual projects priorities, deadlines and deliverables with your technical expertise\nIntegrate and productize analyst and data science models as needed\nAbout You:\nHave a B.E./B.Tech. in Computer Science, Engineering, Information Systems or equivalent experience\nSelf-starter with 3+ years of experience as a Data Engineer dealing with large complex data scenarios\nHave serious data modeling and SQL skills\nExperience with Python and Git\nExperience with both compiled and scripting programming languages\nExperience working with RDBMS like Oracle, MySQL, etc.\nExcellent communication (verbal and written) and interpersonal skills and an ability to effectively communicate with both business and technical teams\nBonus Points:\nExperience owning data pipelines in a production environment\nExperience with Python ETL tools such as Luigi, Airflow, PySpark Stitch\nExperience with other ETL tools such as FiveTran, Stitch, CloverDX, dbt\nExperience working on public cloud offerings like AWS, Azure, GCP, OCI\nExperience working with NoSQL databases like Redis, DynamoDB, etc.\nDetailed Description and Job Requirements\nDesign, develop, troubleshoot and debug data pipelines for analytics products\n\nAs a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of data pipelines. Specify, design and implement modest changes to existing architecture to meet changing needs.\n\nDuties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. B.E., B.Tech. or M.Tech. degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience.\n\nDetailed Description and Job Requirements\nDesign, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc.\n\nAs a member of the software engineering division, you will assist in defining and developing software for tasks associated with the developing, debugging or designing of software applications or operating systems. Provide technical leadership to other software developers. Specify, design and implement modest changes to existing software architecture to meet changing needs.\n\nDuties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience."}, {"link": "https://www.indeed.co.in/rc/clk?jk=e5928266fbd48797&fccid=6c6f37e2a6cb4c55&vjs=3", "location": "Bengaluru", "title": "Opportunities for Women Talent at Applied Materials", "company": "Applied Materials Inc.", "salary": NaN, "desc": "About Applied Materials:\nApplied Materials is the leader in materials engineering solutions used to produce virtually every new chip and advanced display in the world. Our expertise in modifying materials at atomic levels and on an industrial scale enables customers to transform possibilities into reality. At Applied Materials, our innovations make possible the technology shaping the future.\nWe are exclusively hiring for Women talent across levels and for various positions.\nPlease find below list of job opportunities at Applied Materials India. Once we receive the relevant resume, Staffing team will reach out to you if the profile is shortlisted.\nJava Developer\nC# Developer\nC++ Developer\nData Scientist\nAlgorithm Developer\nMechanical Engineer\nElectrical Engineer\nMechatronics Engineer\nRobotics Engineer\nReliability Engineer\nChemist\nNew Product Manufacturing Engineer\nProcess Engineer\nTechnical Product Support / Global product support\nApplication Engineer\nBusiness Intelligence Analyst\nRF Engineer\nOrder Management\nAnd many more.....\nFunctional Knowledge\nDemonstrates conceptual and practical expertise in own discipline and basic knowledge of related disciplines\nBusiness Expertise\nHas knowledge of best practices and how own area integrates with others; is aware of the competition and the factors that differentiate them in the market\nLeadership\nActs as a resource for colleagues with less experience; may lead small projects with manageable risks and resource requirements\nProblem Solving\nSolves complex problems; takes a new perspective on existing solutions; exercises judgment based on the analysis of multiple sources of information\nImpact\nImpacts a range of customer, operational, project or service activities within own team and other related teams; works within broad guidelines and policies\nInterpersonal Skills\nExplains difficult or sensitive information; works to build consensus\nQualifications\nEducation:\nBachelor's Degree\nSkills\nCertifications:\nLanguages:\nYears of Experience:\n4 - 7 Years\nWork Experience:\nAdditional Information\nTravel:\nNo\nRelocation Eligible:\nNo\nApplied Materials is committed to diversity in its workforce including Equal Employment Opportunity for Minorities, Females, Protected Veterans and Individuals with Disabilities."}, {"link": "https://www.indeed.co.in/rc/clk?jk=0dc818bc520e1bba&fccid=ccd32f626fb21bb9&vjs=3", "location": "Bengaluru", "title": "Data Analyst", "company": "Collabera Technologies Private Limited", "salary": NaN, "desc": "Good Knowledge of Adobe Analytics/Omniture/Sitecatalyst Implementation\nGood Knowledge of using Analysis Workspace, Adhoc Analysis, Segmentation and other features of Adobe Analytics.\nHave some exposure to SQL and Databases\nExposure to Python will be a plus.\n\n3.00-5.00 Years"}, {"link": "https://www.indeed.co.in/rc/clk?jk=bd5a85e91163f80f&fccid=de71a49b535e21cb&vjs=3", "location": "Bengaluru", "title": "Data Engineer: Enterprise Content Management", "company": "IBM", "salary": NaN, "desc": "Introduction\nAt IBM, work is more than a job - it's a calling: To build. To design. To code. To consult. To think along with clients and sell. To make markets. To invent. To collaborate. Not just to do something better, but to attempt things you've never thought possible. To lead in this new era of technology and solve some of the world's most challenging problems.\n\nYour Role and Responsibilities\nAs an OpenText Solution Architect, you will work in large-scale and complex business and technical environments, experienced in managing complex structured and unstructured content solutions or initiatives.\nResponsibilities:\nDefine the technical strategy and plan for modeling the Enterprise Content Management (ECM) to enable the development of high value solutions with business needs\nCollaborate with Analysts and Partners on requirements and solution design\nDesign code based on development standards and approaches\nPerform development quality checks while providing guidance and mentorship to junior developers\nDevelop new applications, forms, reports, workflows leveraging different Open Text products in the landscape\nSupport with code build and deployment process\nCoordinate communications, issue resolution, implementation and testing plans, training plans and successful transition to support and maintenance teams of architecture and operations activities\nResponsible for guiding and reviewing the development of solutions specified in technical design\nIf you thrive in a dynamic, collaborative workplace, IBM provides an environment where you will be challenged and inspired every single day. And if you relish the freedom to bring creative, thoughtful solutions to the table, there's no limit to what you can accomplish here\n\nRequired Technical and Professional Expertise\nMinimum 6+ years of experience SAP OpenText ECM, OpenText Archiving and Document Access and OpenText Data Archiving for SAP Solutions\nExperience integrating Open Text solutions with SAP S/4 HANA\nExperience in working on OpenText Content Server/Livelink and other related OpenText products\nExperience working with various module integrations with OpenText\nAbility to prioritize and manage work while proactively monitoring and communicating for timely escalation of issues\nProven experience on the OpenText Content Server platform (using Content Server Web Services, REST APIs, OScript)\nHands on development experience with HTML, CSS, JavaScript, XML/XSL and SQL\nExperience working with Workflows, CS Widgets, Workspaces, Connected Workspaces, Web Reports, Web Forms, Templates in Livelink/Content Server Java or NET development experience with good knowledge of Object oriented programming concepts and Service Oriented Architecture\n\nPreferred Technical and Professional Expertise\nGood understanding of the overall ECM processes and concepts (Capture, Manage, Store, Preserve, Deliver)\nExperience working with other OpenText products like Archive Server, OTDS, Enterprise Scan, Enterprise Connect, Document Pipeline, Rendition Server, Capture Center, InfoFusion, OTMM, EPS, Process Suite, Output Center is preferred\nYou love collaborative environments that use agile methodologies to encourage creative design thinking and find innovative ways to develop with cutting edge technologies\nAmbitious individual who can work under their own direction towards agreed targets/goals and with creative approach to work\nIntuitive individual with an ability to manage change and proven time management\nProven interpersonal skills while contributing to team effort by accomplishing related results as needed\nUp-to-date technical knowledge by attending educational workshops, reviewing publications\n\nAbout Business Unit\nIBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter business by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence.\n\nYour Life @ IBM\nWhat matters to you when you’re looking for your next career challenge?\n\nMaybe you want to get involved in work that really changes the world. What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible.\n\nImpact. Inclusion. Infinite Experiences. Do your best work ever.\n\nAbout IBM\nIBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries.\n\nLocation Statement\nFor additional information about location requirements, please discuss with the recruiter following submission of your application.\n\nBeing You @ IBM\nIBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status."}, {"link": "https://www.indeed.co.in/rc/clk?jk=38de23ee46629e9a&fccid=2df6a1e69a70a1e7&vjs=3", "location": "Bengaluru", "title": "Sr. Associate - Projects", "company": "Cognizant", "salary": NaN, "desc": "Project Manager\nQualification:\nBachelors in science , engineering or equivalent\nResponsibility:\nProject Planning and Setup:\nUnderstand the project scope, identify activities/ tasks, task level estimates, schedule, dependencies, risks and provide inputs to Module Lead for review.\nProvide inputs to testing strategy, configuration, deployment, hardware/software requirement etc.\nReview plan and provide feedback on gaps, timeline and execution feasibility etc as required in the project.\nParticipate in KT sessions conducted by customer/ other business teams and provide feedback on requirements.\nRequirement Understanding and Analysis:\nAnalyze functional/non functional requirements and seek clarifications for better understanding of requirements.\nBased on understanding of system upstream & downstream, provide feedback and inputs on gaps in requirements and technical feasibility of requirements.\nDesign:\nPrepare the LLD/ detailed design documents based on HLD and briefing from Module Lead.\nSeek inputs from the developers on specific modules as applicable.\nConsolidate all modules and provide to Module Lead/ Architects/ Designers for review.\nSuggest changes in design on technical grounds.\nDevelop components inventory for the code to be developed tying it to the nonfunctional requirements.\nPerform sampling of data to understand the character/ quality of the data (project dependent in the absence of data analyst or designer).\nIdentify tools and technologies to be used in the project as well as reusable objects that could be customized for the project.\nCoding:\nFollow coding standards and best practices to develop code and check code quality.\nShare developed code with supervisor for review.\nRework on the code based on inputs if required.\nPerform complex integration.\nGuide the developers in identifying, preparing and conducting unit test cases and fixing defects based on results.\nConsolidate the test results and share with supervisor.\nProvide periodic status update to supervisor and highlight / recommend any changes in design based on challenges faced.\nAnticipate unreported defects and raise the same to supervisor.\nConduct technical troubleshooting.\nConduct reviews for codes created by team.\nTesting Management:\nDevelop unit test case for each module.\nConduct/ guide conducting of unit and integration testing and fix defects.\nReview/ approve code to be moved to testing environment.\nProvide support to the QA team and coordinate for various phases of testing.\nAddress queries raised by QA within defined timelines.\nInvestigate critical defects and establish need for fixing.\nRaise issues to leads/QA.\nReport defect status as per project standard process within agreed timelines.\nShare revised code with supervisor for review.\nAssist team lead and project manager on estimates around defect fixes.\nConfiguration Management:\nMaintain versions of the code or consolidate version maintained by the Developers.\nProvide support as required to the Administrators during configuration, code backups, deployment etc.\nDeployment:\nAssess and create deployment/ roll back plan.\nValidate if all the components have been migrated and the right version is checked in.\nMaintain deployment tracker.\nPerform sanity checks post deployment to ensure smooth production.\nShare activity status with supervisor and highlight concerns if any.\nProject Execution Monitoring & closure (Support to Project Management activities):\nMonitor work of the developers and share work achieved with them.\nProvide guidance through SDLC.\nProvide status of progress to leads.\nIn case of change requests, provide inputs on the plan.\nService Support and Maintenance:\nSpecific to production and maintenance support:\nProvide support for 1 week and hand over to production team.\nIdentify if the incoming request is a service request/ defect during the warranty or an incident.\nIf it is code defect in the warranty, highlight to Lead and initiate defect fix process.\nPost warranty, support in transition to maintenance team.\nKnowledge Management:\nPost release participate in project review call and discuss points on what went well and what didn't.\nCreate and update knowledge articles (case studies, lessons learnt) in the knowledge management repository.\nGuide developers in creating such documents.\nPublish white papers/ blogs/ articles (if required).\nPeople Management:\nConduct training through academy or internally within the team.\nConduct technical, face to face interviews for internal transfer or external hiring.\nProvide feedback on Developers form technical /domain standpoint to the module lead.\nMust Have Skills\nCognos TM1\nIBM Cognos TM1 Architect\nOrder to Cash Order Management\nEmployee Status : Full Time Employee\nShift : Day Job\nTravel : No\nJob Posting : Jul 04 2020\nAbout Cognizant\nCognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 193 on the Fortune 500 and is consistently listed among the most admired companies in the world."}, {"link": "https://www.indeed.co.in/rc/clk?jk=5c2324308c234573&fccid=c00062962160dc76&vjs=3", "location": "Bengaluru", "title": "Senior Video Analyst Day Shift", "company": "Innovary Technologies", "salary": NaN, "desc": "Innovary Technologies is looking for Sr. Data Analyst who is result oriented individual contributor with passion on Traffic Data Analysis and People behavior Analysis.\nJob Position: Senior Video Analyst\nJob Role: Process Traffic Footage and Turn into Accurate Data\nJob Type: Non-Technical\nExperience Required : 1-3 Years\nDesired Qualification: Any Graduate or Post Graduate\nDesired skills:\nTime Management\nBasic Knowledge of Computer (MS Office/Typing Skills)\nHard and Smart working\nLaser focus towards data quality\nMeet and exceed customer expectations\nReady to work under moderate pressure\nPositive attitude, energetic and self-motivated\nExcellent verbal and written communication skills\nJob Descriptions:\nWatch Traffic Videos and Count number of Cars, Buses, Motorcycles, Trucks and Bicycles.\nNo voice process and Purely non-technical job, not a software job (no programming skills required!)\nNo bond, no security deposit, no need to surrender your original certificates\nDirect job with company, not a consultancy!\nTraining Period:\n6 days of training on this domain free of cost. (6 Working Days only)\nNo training fee and Training will be offered by our Internal team only.\nNo salary during training period.\nSalary:\n1st month: 12,000 INR take home\n2nd month: 12,500 INR take home\n3rd month on-wards: 13,000 INR take home\nWorking Hours:\nMonday to Saturday 09:00 to 19:00 IST\n12 paid leaves per year (1 Paid leave each month)\n12-13 national/public/festival holidays per year"}, {"link": "https://www.indeed.co.in/rc/clk?jk=1b853a5b66819994&fccid=adad512f93b8b92e&vjs=3", "location": "Bengaluru", "title": "Data Engineer, Programming & Azure", "company": "Fractal.ai", "salary": NaN, "desc": "About Fractal\nWhat makes Fractal a GREAT fit for you? When you join Fractal, youll be part of a fast-growing team that helps our clients leverage AI together with the power of behavioural sciences to make better decisions. Were a strategic analytics partner to most admired fortune 500 companies globally, we help them power every human decision in the enterprise by bringing analytics, AI and behavioural science to the decision.\nOur people enjoy a collaborative work environment, exceptional training and career development as well as unlimited growth opportunities. We have a Glassdoor rating of 4 / 5 and achieve customer NPS of 9/ 10. If you like working with a curious, supportive, high-performing team, Fractal is the place for you.\nRole Brief:\nIf you are an extraordinary developer and who loves to push the boundaries to solve complex business problems using creative solutions, then we wish to talk with you. As an Analytics Technology Engineer, you will work on the Technology team that helps deliver our Data Engineering offerings at large scale to our Fortune clients worldwide. The role is responsible for innovating, building and maintaining technology services\nResponsibilities:\nBe an integral part of large scale client business development and delivery engagements\nDevelop the software and systems needed for end-to-end execution on large projects\nWork across all phases of SDLC, and use Software Engineering principles to build scaled solutions\nBuild the knowledge base required to deliver increasingly complex technology projects\nQualifications & Experience\nA bachelor's degree in Computer Science or related field with 3 to 8 years of technology experience\nStrong experience in System Integration, Application Development or Data-Warehouse projects, across technologies used in the enterprise space\nSoftware development experience using:\nObject-oriented languages (e.g. Python, PySpark, Java, C#, C++ ) and frameworks (e.g. J2EE or .NET)\nDatabase programming using any flavours of SQL\nExpertise in relational and dimensional modelling\nExposure across all the SDLC process, including testing and deployment\nExposure to Azure cloud is mandatory\nProven track record in keeping existing technical skills and developing new ones, so that you can make strong contributions to deep architecture discussions around systems and applications in the cloud (Azure, AWS or GCP)\nCharacteristics of a forward thinker and self-starter that flourishes with new challenges and adapts quickly to learning new knowledge\nAbility to work with a global team of consulting professionals across multiple projects\nKnack for helping an organization to understand application architectures and integration approaches, to architect advanced cloud-based solutions, and to help launch the build-out of those systems\nPassion for educating, training, designing, and building end-to-end systems for a diverse and challenging set of customers to success\nEducation Qualification:B.E / B.Tech, BCA, MCA equivalent\nLocation: Bangalore"}, {"link": "https://www.indeed.co.in/rc/clk?jk=48b88f38c6dce27f&fccid=3d0f7ba22a49432f&vjs=3", "location": "Bengaluru", "title": "Sr. Resident Solutions Engineer", "company": "Databricks", "salary": NaN, "desc": "Mission\nAs a Senior Resident Solutions Engineer, you will have the opportunity to shape the future big data landscape for leading Fortune 500 organizations. This position is a customer-facing role that requires experience in Apache Spark™ along with previous big data solution architecture experience.\nOn a weekly basis, you will guide customers through architecture, design, and implementation while strategically aligning their technical roadmap for expanding the usage of the Databricks platform. As part of the RSA team, you will continue to strengthen your technical expertise through mentorship, continuous learning, and internal training programs. This role can be remote, but the ideal candidate will be located in the job listing area and have a willingness to travel up to 30%.\nOutcomes\nProvide technical leadership in a post-sales capacity to guide strategic customers as they design and implement big data projects, ranging from architectural design to data engineering to model deployment\nIdentify and drive new initiatives that enable customers to turn their data into actionable business value and align these initiatives with their business outcomes for continued success\nArchitect production level workloads, including end to end pipeline load performance testing and optimization\nDeliver tutorials and trainings to drive community adoption (including hackathons, conference presentations, etc.)\nWork closely with Engineering and Product Management to drive the direction of the Databricks product\nContribute to Databricks SME community\nCompetencies\nHands-on and superior technical experience with Apache Spark\nProven experience of design and implementation experience in big data technologies including Hadoop, NoSQL, MPP, OLTP, OLAP\n3+ years experience working as either:\nSoftware Engineer/Data Engineer: query tuning, performance tuning, troubleshooting, and debugging Spark and/or other big data solutions.\nData Scientist/ML Engineer: model selection, model lifecycle, hyperparameter tuning, model serving, deep learning, etc.\nComfortable programming in Python, Scala or Java\nExperience using and designing solutions on cloud infrastructure and services, such as AWS, Azure, or GCP\nExperience with Development Tools for CI/CD, Unit and Integration testing, Automation and Orchestration, REST API, BI tools and SQL Interfaces. E.g. Jenkins\nProven experience with ML concepts covering Model Tracking, Model Serving and other aspects of productionizing ML pipelines in distributed data processing environments like Apache Spark, using tools like MLflow\nExcellent communication skills and comfortable presenting to strategic stakeholders/leadership\nExperience in customer-facing pre-sales, post-sales, technical architecture guidance, or consulting\nPassionate about learning new technologies and making customers successful\nAbout Databricks\nDatabricks’ mission is to accelerate innovation for its customers by unifying Data Science, Engineering and Business. Founded by the original creators of Apache Spark™, Databricks provides a Unified Analytics Platform for data science teams to collaborate with data engineering and lines of business to build data products. Users achieve faster time-to-value with Databricks by creating analytic workflows that go from ETL and interactive exploration to production. The company also makes it easier for its users to focus on their data by providing a fully managed, scalable, and secure cloud infrastructure that reduces operational complexity and total cost of ownership. Databricks, venture-backed by Andreessen Horowitz, NEA and Battery Ventures, among others, has a global customer base that includes Viacom, Shell, and HP. .\nApache, Apache Spark and Spark are trademarks of the Apache Software Foundation."}, {"link": "https://www.indeed.co.in/company/ITTSTAR/jobs/Requirement-Data-Engineer-Aws-Stack-49541878d3d8620a?fccid=a94771d35db27642&vjs=3", "location": "Bengaluru", "title": "Immediate Requirement for Data Engineer – AWS Stack", "company": "ITTSTAR", "salary": NaN, "desc": "ob Title: Data Engineer – AWS Stack\nLocation: Bangalore\nExperience : 5+ Years\nWe have updated the requirement to focus only on AWS\nThe qualifications should be:\n1. M.E/M.Tech/B.E/B.Tech/MCA/MSc or similar 4 or 4+ years degree in relevant field.\n2. At least 3+ years of hands on experience on\na. AWS [S3, EC2, ECS, EMR, GLUE, Redshift, Lambda, Dynamo DB , Kinesis, RDS, Data Pipeline etc]\n3. At least 3+ years of hands on experience with Big Data stack including\na. Spark\nb. Hadoop\nc. Hive\nd. Kafka\ne. HBase or other NoSQL solutions\n4. Strong knowledge and handson experience in writing highly optimized and if required complex queries. [Oracle/Postgres /MySQL/ SQLServer etc]\n5. Strong Python Programming knowledge from Data Engineering perspective. Good knowledge on libs like\na. Pandas\nb. Numpy\nc. Matlabplot\nd. Seaborn\ne. ScikitLearn etc\n6. Experience building and optimizing ‘big data’ data pipelines, architectures and data sets.\n7. Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement.\n8. Strong analytic skills related to working with unstructured datasets.\n9. Build processes supporting data transformation, data structures, metadata, dependency and workload management.\n10. A successful history of manipulating, processing and extracting value from large disconnected datasets.\n11. Strong project management and organizational skills.\n12. Experience supporting and working with cross-functional teams in a dynamic environment.\n13. Good Communication Skills.\nYou can call me for any queries.\nplease send your resume at anuja(dot)jadhav(attherate)ittstar.com\nfollowing details\ncurrent ctc\nexpected ctc\nnotice period\nJob Type: Full-time"}, {"link": "https://www.indeed.co.in/rc/clk?jk=f4e87d0762b6ee92&fccid=2b1e42f645eeaf1e&vjs=3", "location": "Bengaluru", "title": "CIEL/SEL/13375: Senior Big Data Engineer", "company": "CIEL HR Services", "salary": NaN, "desc": "4+ years of production level experience in one of Java, Scala, JavaScript, C++ or Python\nExperience in architecting, developing, deploying and operating large scale distributed systems\nExperience with usability and user experience\nExperience with cloud APIs (e.g., a public cloud such as Azure, AWS, GCP or an advanced private cloud such as Google, Facebook)\nExperience working on a SaaS platform or with Service Oriented Architectures\nGood knowledge of Linux OS\nExperience with API development\nGood knowledge of SQL (MySQL preferred)\nExperience with software security and systems that handle sensitive data Exposure to container technologies, such as Docker Experience with Continuous Integration/Continuous Deployment frameworks\n\nDevelop and extend the Databricks product. This implies, among others, writing software in Scala, Python or Javascript and/or interacting with: cloud APIs (e.g., compute APIs, cloud formation, Terraform), with open source and third-party APIs and software (e.g., Kubernetes) and with internal APIs.\nBe responsible for full software development lifecycle - design, development, testing, operating in production\nArchitect solutions to achieve a high level of reliability, scalability, and security\nCommunicate effectively with other engineers in the same team, with other teams and with various other stakeholders such as product managers\nOperate in an Agile development environment"}, {"link": "https://www.indeed.co.in/rc/clk?jk=e9f03f32f060ad29&fccid=b11b139fe72c1f23&vjs=3", "location": "Bengaluru", "title": "Cloud Platform Architect", "company": "Cervello Inc", "salary": NaN, "desc": "Cervello’s Cloud Platforms & Infrastructure Center of Excellence and we’re looking for the right experience Cloud Architect to add to our ranks. Do you want to take your career in Cloud Engineering to support Big Data and/or Analytics? Would you prefer to be in a platform agnostic environment working on some of the largest and most cutting-edge solutions in Data & Analytics? As an Architect on our Cloud Platforms & Infrastructure team, you will work with our teams to design, build and maintain cloud environments in any of the major Cloud providers (AWS, Azure, Google Cloud Platform - GCP to name a few). This role will also include building, mentoring our Bangalore team and a willingness to assist in developing training collateral for our COE. While we expect you to have strong experience in infrastructure, #1 attribute we look for in all team members is a desire to learn and try new things and to participate in the development of the COE. We feel the platforms are evolving and you should want to grow too! As an Architect, you’ll brainstorm and design the technical infrastructure and deployment of various enterprise level multi-tenant IaaS and PaaS solutions around Data & Analytics solutions. We think it’s vital to be open to trying new techniques, learning from all levels of the team, and to ready, willing and able to learn new technologies because they’re popping up fast in this growing field. This role offers amazing growth potential professionally since we are platform agnostic and work on bleeding edge solutions in the cloud!\n\nRole/Responsibilities of an Architect/Cloud Engineer\nArchitect on our Cloud Platforms and Infrastructure team has close to 5 – 8 years of experience in DevOps, SecOps, or SysOps in a large enterprise environment and would take a lead role in the design and analysis of a Cloud - based Big Data and Analytics solution in a variety of industries and computing environments.\nArchitects plan system and development deployment and are responsible for meeting software compliance requirements.\nA key part of consulting versus being in an IT role, is that you would be able to articulate the differences between hardware and software options, operational requirements, and characteristics of the overall systems to help shape the solution.\nYour expertise in the use of Cloud architecture and solutions to support Big Data and Analytics solutions would enable software deployment in a DevOps environment.\nYou would have strong comprehension of a wide application of technical principles, theories, and concepts in the field and apply general knowledge of related disciplines. Mentor Junior resources with your ideas and make them leaders\nYou’d provide technical solutions related to supporting Big Data in the cloud to a wide range of difficult problems.\nSkills and Qualifications\nBachelor’s Degree or equivalent experience\n5 years of experience in a Cloud Engineering role\nExtensive experience in multiple operating systems - UNIX, Windows, LINUX\n3+ years’ experience with multi-threaded, big data, distributed Cloud architectures and frameworks, including Hadoop, MapReduce, Spark, Hive, and Elastic Search for the purpose of conducting big data analytics\nStrong experience (5+ years) with Amazon Web Services, Azure or Google Cloud Platform and all supporting technologies\nExpertise in troubleshooting very complex distributed environments, including following stack traces back to code and come up with a good root cause\nStrong background with Extract, Transform and Load (ETL) processes including document parsing techniques and mapping large data sets such as multi TB scale\nWillingness and appetite for continuous learning\nDesire to participate in the hiring and development of the team.\nAdditional Preferences\nAGILE (Scrum, Kanban, SAFe)\nAt least one Certification required- AWS (Solution Architect), AZURE (MSCE Cloud Expert), Google (Certified Data Engineer, Certified Cloud Admin)\nVLDB, OLTP, OLAP, EDW, Big Data, Streaming, Advanced Analytics efforts in the cloud\nBS Degree in CS, Statistics, Physics, Math, Engineering, etc.\n\nPowered by JazzHR"}, {"link": "https://www.indeed.co.in/rc/clk?jk=ef6a9ae50db0ca59&fccid=057abf3fd357e717&vjs=3", "location": "Delhi", "title": "Lead Data Analyst", "company": "Barclays", "salary": NaN, "desc": "Job Title:Lead Data Analyst\nLocation:Noida\nThe purpose of the Barclaycard Risk Strategy team is to drive value through appropriate Risk Management of relevant credit risk analytics and strategies for the portfolios allocated.\nProvide advanced presentation methods and tools to manage, negotiate and influence a variety of Senior CRO and commercial stakeholders using knowledge formed from a deep understanding of portfolio’s and segments.\nOversee the production of ad-hoc MI and provide support to the wider CRO teams and senior management/stakeholders.\nProduction of a range of reports to establish credit performance, specifically to contribute and present to the monthly Risk Management Committee and senior stakeholder meetings – provide recommendations (where appropriate) and influence/negotiate with stakeholders to obtain delivery/sign off.\nThe role holder will need to mentor junior team members as required\nThey will also need to drive a culture of continuous improvement and maintain an effective working relationship with stakeholders across functions and locations.\nWhat will you be doing:\nProvide best-in-class analytics (50%)\nWork closely with your team to provide in-depth monitoring of performance of certain reports/analysis, spotting trends and insights & driving any necessary corrective actions\nLiaising with key internal and external stakeholders (specifically Chief Credit Officer and Head of Commercial teams) to ensure analysis/context is complete.\nOn-going monitoring of performance.\nEnsure MI, Insight and commentary is accurate, timely and that any changes required by senior management are also delivered.\nBe creative in your approach to data analysis / performance mgt, obtaining insights in different ways and demonstrating expertise to provide new ways of managing portfolio risk. Constantly assess the team’s performance, looking for continual improvements\nRespond to requests for information from senior management. Producing timely, clear and accurate data/insight to meet those requests.\nStakeholder Management and Leadership (20%)\nThe key stakeholders of this role will be\nThe other members of the CRO team\nCollections, Fraud and other Operations teams\nThe Commercial team\nStrategic Analytics team\nFinance\nRisk & Governance\nThe person will need to work effectively with colleagues across these stakeholders to achieve shared business objectives. This includes sharing analytical insights, and presenting / defending these conclusions in appropriate formal and informal forums.\nMentoring (10%):\nDevelop a high performing team through support / challenge / direction of junior team members\nEngage and motivate junior team members towards achieving goals.\nImprove Internal Processes (10%)\nIdentify new opportunities for enhancing/ streamlining services\nFormulate opportunities into proposals, share with the manager and implement\nTeam Player Activities (10%):\nWork effectively with peers and management team to achieve shared business objectives\nContribute to the wider colleague agenda of the Barclaycard Risk Strategy India Hub\nWhat we’re looking for:\nBusiness Skills- Strong business acumen and understanding of consumer lending business specially in unsecured lending domain\nReporting Skills- Use tools such as Microsoft PowerPoint to transform data in to visually appealing reports which is easy to grasp\nCommunication – Effectively and concisely communicate key issues and ideas through correspondences and verbally. Interface with seniors effectively. Interface with various departments effectively to ensure project delivery.\nCommercial skills -Create and implement project task plans to accomplish business plan objectives.\nConceptual thinking - Strong strategic thinker with good intellect and ability to focus on different parts of the portfolio and their associated value generation. Strong project management skills with the ability to adapt to several projects simultaneously.\nTeam work – Commitment and ability to work with, and in, cross-functional and virtual teams – coupled with ability for straight talking.\nAnalytical skills – Ability to problem solve and translate data into relevant risk and business information.\nInnovation – Create appealing and innovative product concepts and communications. Ability to evaluate risk management concepts and communications.\nValue based business perspective - the ability to be able to analyse the portfolio on a value basis, understanding both high level results and key value drivers.\nA degree in an analytical/business related discipline\nAbility to generate insights from data, assess the commercial / financial impact and recommend action\nExtensive experience analysing programmes through the lens of risk management\nUnderstanding of statistical methods to enable appropriate interpretation of results\nComprehensive knowledge and effective use of analytical tools including SQL and SAS.\nProficient in Microsoft PowerPoint , Word and Excel\nFamiliarity with risk reporting and risk management models.\nFamiliarity with segmentation tools and strategies.\nConceptual thinking – find innovative ways to solve analytical problems\nAbility to deliver accurate results within tight deadlines\nTeam work – Commitment and ability to work with cross-functional teams\nStrong interpersonal skills\nExcellent Oral and written communication skills with ability to translate insight into a coherent story\nEffective stakeholder management skills\nLeadership skills\nExperienced in delivering complex projects through effective stakeholder management\nSkills that will help you in the role:\nPost-graduate degree\nExtensive experience analysing programmes through the lens of Cards P&L and customer metrics.\nIndustry knowledge (ideally experience with major international financial services firm)\nWhere will you be working?\nNoida\nBe More at Barclays\nAt Barclays, each day is about being more – as a professional, and as a person. ‘Be More @ Barclays’ represents our core promise to all current and future employees. It’s the characteristic that we want to be associated with as an employer, and at the heart of every employee experience. We empower our colleagues to Be More Globally Connected, working on international projects that improve the way millions of customers handle their finances. Be More Inspired by working alongside the most talented people in the industry, and delivering imaginative new solutions that are redefining the future of finance. Be More Impactful by having the opportunity to work on cutting-edge projects, and Be More Valued for who you are.\nInterested and want to know more about Barclays? Visit home.barclays/who-we-are/ for more details.\n\nOur Values\nEverything we do is shaped by the five values of Respect, Integrity, Service, Excellence and Stewardship. Our values inform the foundations of our relationships with customers and clients, but they also shape how we measure and reward the performance of our colleagues. Simply put, success is not just about what you achieve, but about how you achieve it.\n\nOur Diversity\nWe aim to foster a culture where individuals of all backgrounds feel confident in bringing their whole selves to work, feel included and their talents are nurtured, empowering them to contribute fully to our vision and goals.\n\nOur Benefits\nOur customers are unique. The same goes for our colleagues. That's why at Barclays we offer a range of benefits, allowing every colleague to choose the best options for their personal circumstances. These include a competitive salary and pension, health care and all the tools, technology and support to help you become the very best you can be. We are proud of our dynamic working options for colleagues. If you have a need for flexibility, then please discuss this with us."}]